jassony/infineon2b6/TLE9563_LLD/inc/TLE9563.h
/*
 * Copyright (c) 2009-2019 ARM Limited. All rights reserved.
 * 
 * SPDX-License-Identifier: Apache-2.0
 * 
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 * http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * @file     Infineon-TLE9563-3QX_builtbySEV.h
 * @brief    CMSIS HeaderFile
 * @version  0.2.0
 * @date     03. December 2021
 * @note     Generated by SVDConv V3.3.39 on Friday, 03.12.2021 10:40:15
 *           from File '../__scripts/svd/Infineon-TLE9563-3QX_builtbySEV.svd',
 *           last modified on Friday, 03.12.2021 09:39:11
 */



/** @addtogroup Infineon
  * @{
  */


/** @addtogroup TLE9563
  * @{
  */

#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>

#ifndef TLE9563_H
#define TLE9563_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/* =========================== Configuration of the ARM Cortex-M0 Processor and Core Peripherals =========================== */


/* IO definitions (access restrictions to peripheral registers) */
/**
    \defgroup CMSIS_glob_defs CMSIS Global Defines

    <strong>IO Type Qualifiers</strong> are used
    \li to specify the access to peripheral variables.
    \li for automatic generation of peripheral register debug information.
*/
#ifdef __cplusplus
  #define   __I     volatile             /*!< Defines 'read only' permissions */
#else
  #define   __I     volatile const       /*!< Defines 'read only' permissions */
#endif
#define     __O     volatile             /*!< Defines 'write only' permissions */
#define     __IO    volatile             /*!< Defines 'read / write' permissions */

/* following defines should be used for structure members */
#define     __IM     volatile const      /*! Defines 'read only' structure member permissions */
#define     __OM     volatile            /*! Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*! Defines 'read / write' structure member permissions */

/*@} end of group Cortex_M0 */


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                          TLE9563                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief TLE9563 Module (TLE9563)
  */



typedef struct {                                /*!< (@ 0x00000000) TLE9563 Structure                                          */
  
  union {
    __IOM uint8_t byte;                         /*!< (@ 0x00000000) Status Information field byte                              */
    
    struct {
      __IOM uint8_t SUPPLY_STAT : 1;            /*!< [0..0] OR of all bits on SUP_STAT register                                */
      __IOM uint8_t TEMP_STAT   : 1;            /*!< [1..1] OR of all bits on THERM_STAT register                              */
      __IOM uint8_t BUS_STAT    : 1;            /*!< [2..2] OR of all bits on BUS_STAT register                                */
      __IOM uint8_t WAKE_UP     : 1;            /*!< [3..3] OR of all bits on WK_STAT register                                 */
      __IOM uint8_t HS_STAT     : 1;            /*!< [4..4] OR of all bits on HS_OL_OC_OT_STAT register                        */
      __IOM uint8_t DEV_STAT    : 1;            /*!< [5..5] OR of all bits on DEV_STAT except CRC_STAT and SW_DEV              */
      __IOM uint8_t BD_STAT     : 1;            /*!< [6..6] OR of all bits on DSOV register                                    */
      __IOM uint8_t SPI_CRC_FAIL: 1;            /*!< [7..7] (SPI_FAIL) OR (CRC_FAIL)                                           */
    } bit;
  } SIF;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000000) Mode and Supply Control                                    */
    
    struct {
      __IOM uint16_t VCC1_RT    : 2;            /*!< [1..0] VCC1 Reset Threshold Control                                       */
            uint16_t            : 3;
      __IOM uint16_t I_PEAK_TH  : 1;            /*!< [5..5] VCC1 Active Peak Threshold Selection                               */
            uint16_t            : 1;
      __IOM uint16_t RSTN_HYS   : 1;            /*!< [7..7] VCC1 Undervoltage Reset Hysteresis Selection (see also
                                                     Chapter 12.7.1 for more information)                                      */
            uint16_t            : 1;
      __IOM uint16_t VCC1_OV_MOD : 2;           /*!< [10..9] Reaction in case of VCC1 Over Voltage                             */
            uint16_t            : 3;
      __IOM uint16_t MODE       : 2;            /*!< [15..14] Device Mode Control                                              */
    } bit;
  } M_S_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000002) Hardware Control                                           */
    
