jassony/infineon2b6/TLE9563_LLD/inc/TLE9563.h
    struct {
            uint16_t            : 2;
      __IOM uint16_t WD_STM_EN_1 : 1;           /*!< [2..2] Watchdog Deactivation during Stop Mode, bit1                       */
            uint16_t            : 3;
      __IOM uint16_t SOFT_RESET_RO : 1;         /*!< [6..6] Soft Reset Configuration                                           */
            uint16_t            : 2;
      __IOM uint16_t RSTN_DEL   : 1;            /*!< [9..9] Reset delay time                                                   */
      __IOM uint16_t SH_DISABLE : 1;            /*!< [10..10] Sample and hold circuitry disable                                */
      __IOM uint16_t VS_OV_SEL  : 1;            /*!< [11..11] VS OV comparator threshold change                                */
      __IOM uint16_t TSD2_DEL   : 1;            /*!< [12..12] TSD2 minimum Waiting Time Selection                              */
            uint16_t            : 3;
    } bit;
  } HW_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000004) Watchdog Control                                           */
    
    struct {
      __IOM uint16_t WD_TIMER   : 3;            /*!< [2..0] Watchdog Timer Period                                              */
            uint16_t            : 1;
      __IOM uint16_t WD_EN_WK_BUS : 1;          /*!< [4..4] Watchdog Enable after Bus Wake in Stop Mode                        */
      __IOM uint16_t WD_CFG     : 1;            /*!< [5..5] Watchdog Configuration                                             */
      __IOM uint16_t WD_STM_EN_0 : 1;           /*!< [6..6] Watchdog Deactivation during Stop Mode, bit0                       */
            uint16_t            : 8;
      __IOM uint16_t CHECKSUM   : 1;            /*!< [15..15] Watchdog Setting Check Sum Bit                                   */
    } bit;
  } WD_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000006) CAN Control                                                */
    
    struct {
      __IOM uint16_t CAN        : 3;            /*!< [2..0] HS-CAN Module Modes                                                */
            uint16_t            : 13;
    } bit;
  } BUS_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000008) Wake-up Control                                            */
    
    struct {
      __IOM uint16_t WK_BNK     : 3;            /*!< [2..0] WKs input Banking                                                  */
            uint16_t            : 2;
      __IOM uint16_t WK_EN      : 2;            /*!< [6..5] WKx Enable                                                         */
            uint16_t            : 2;
      __IOM uint16_t WK_PUPD    : 2;            /*!< [10..9] WKx Pull-Up/Pull-Down Configuration                               */
      __IOM uint16_t WK_FILT    : 3;            /*!< [13..11] Wake-up Filter Time Configuration                                */
            uint16_t            : 2;
    } bit;
  } WK_CTRL_BNK3;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000000A) Wake-up Control                                            */
    
    struct {
      __IOM uint16_t WK_BNK     : 3;            /*!< [2..0] WKs input Banking                                                  */
            uint16_t            : 2;
      __IOM uint16_t WK_EN      : 2;            /*!< [6..5] WKx Enable                                                         */
            uint16_t            : 2;
      __IOM uint16_t WK_PUPD    : 2;            /*!< [10..9] WKx Pull-Up/Pull-Down Configuration                               */
      __IOM uint16_t WK_FILT    : 3;            /*!< [13..11] Wake-up Filter Time Configuration                                */
            uint16_t            : 2;
    } bit;
  } WK_CTRL_BNK4;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000000C) Timer 1 and Timer2 Control and Selection                   */
    
    struct {
      __IOM uint16_t TIMER1_PER : 3;            /*!< [2..0] Timer1 Period Configuration                                        */
            uint16_t            : 1;
      __IOM uint16_t TIMER1_ON  : 3;            /*!< [6..4] Timer1 On-Time Configuration                                       */
      __IOM uint16_t CYCWK      : 2;            /*!< [8..7] Cyclic Wake Configuration                                          */
      __IOM uint16_t TIMER2_PER : 3;            /*!< [11..9] Timer2 Period Configuration                                       */
            uint16_t            : 1;
      __IOM uint16_t TIMER2_ON  : 3;            /*!< [15..13] Timer2 On-Time Configuration                                     */
    } bit;
  } TIMER_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000000E) High-Side Switch Shutdown Control                          */
    
    struct {
            uint16_t            : 3;
      __IOM uint16_t HS_UV_REC  : 1;            /*!< [3..3] Switch recovery after removal of Undervoltage for HSx              */
            uint16_t            : 1;
      __IOM uint16_t HS_UV_SD_DIS : 1;          /*!< [5..5] Shutdown Disabling of HSx in case of input supply undervoltage     */
      __IOM uint16_t HS_OV_SDS_DIS : 1;         /*!< [6..6] Shutdown Disabling of HSx in case of input supply overvoltage
                                                     in Stop Mode or Sleep Mode                                                */
      __IOM uint16_t HS1_OV_SDN_DIS : 1;        /*!< [7..7] Shutdown Disabling of HS1 in case of input supply overvoltage
                                                     in Normal Mode                                                            */
      __IOM uint16_t HS2_OV_SDN_DIS : 1;        /*!< [8..8] Shutdown Disabling of HS2 in case of input supply overvoltage
                                                     in Normal Mode                                                            */
      __IOM uint16_t HS3_OV_SDN_DIS : 1;        /*!< [9..9] Shutdown Disabling of HS3 in case of input supply overvoltage
                                                     in Normal Mode                                                            */
            uint16_t            : 1;
      __IOM uint16_t HS_OT_SD_DIS : 1;          /*!< [11..11] Shutdown Disabling of all HS in case of Overtemperature
                                                     event                                                                     */
      __IOM uint16_t HS1_OV_REC : 1;            /*!< [12..12] Switch recovery after removal of VS Overvoltage for
                                                     HS1                                                                       */
      __IOM uint16_t HS2_OV_REC : 1;            /*!< [13..13] Switch recovery after removal of VS Overvoltage for
                                                     HS2                                                                       */
      __IOM uint16_t HS3_OV_REC : 1;            /*!< [14..14] Switch recovery after removal of VS Overvoltage for
                                                     HS3                                                                       */
            uint16_t            : 1;
    } bit;
  } SW_SD_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000010) High-Side Switch Control                                   */
    
