jassony/infineon2b6/TLE9563_LLD/inc/TLE9563.h
    struct {
      __IOM uint16_t HS1        : 4;            /*!< [3..0] HS1 Configuration                                                  */
      __IOM uint16_t HS2        : 4;            /*!< [7..4] HS2 Configuration                                                  */
      __IOM uint16_t HS3        : 4;            /*!< [11..8] HS3 Configuration                                                 */
            uint16_t            : 4;
    } bit;
  } HS_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000012) Interrupt Mask Control                                     */
    
    struct {
      __IOM uint16_t SUPPLY_STAT : 1;           /*!< [0..0] SUPPLY Status Interrupt generation                                 */
      __IOM uint16_t TEMP_STAT  : 1;            /*!< [1..1] Temperature Interrupt generation                                   */
      __IOM uint16_t BUS_STAT   : 1;            /*!< [2..2] BUS Interrupt generation                                           */
      __IOM uint16_t HS_STAT    : 1;            /*!< [3..3] High Side Interrupt generation                                     */
      __IOM uint16_t BD_STAT    : 1;            /*!< [4..4] Bridge Driver Interrupt generation                                 */
      __IOM uint16_t SPI_CRC_FAIL : 1;          /*!< [5..5] SPI and CRC interrupt generation                                   */
      __IOM uint16_t WD_SDM     : 1;            /*!< [6..6] Watchdog failure in Software Development Mode                      */
      __IOM uint16_t WD_SDM_DISABLE : 1;        /*!< [7..7] Disable Watchdog in Software Development Mode                      */
      __IOM uint16_t INTN_CYC_EN : 1;           /*!< [8..8] Periodical INTN generation                                         */
            uint16_t            : 7;
    } bit;
  } INT_MASK;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000014) PWM Configuration Control                                  */
    
    struct {
      __IOM uint16_t PWM_BNK    : 3;            /*!< [2..0] Internal PWM generator selection                                   */
            uint16_t            : 1;
      __IOM uint16_t PWM_DC     : 10;           /*!< [13..4] PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB)                  */
      __IOM uint16_t PWM_FREQ   : 1;            /*!< [14..14] PWM generator Frequency Setting                                  */
            uint16_t            : 1;
    } bit;
  } PWM_CTRL_BNK0;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000016) PWM Configuration Control                                  */
    
    struct {
      __IOM uint16_t PWM_BNK    : 3;            /*!< [2..0] Internal PWM generator selection                                   */
            uint16_t            : 1;
      __IOM uint16_t PWM_DC     : 10;           /*!< [13..4] PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB)                  */
      __IOM uint16_t PWM_FREQ   : 1;            /*!< [14..14] PWM generator Frequency Setting                                  */
            uint16_t            : 1;
    } bit;
  } PWM_CTRL_BNK1;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000018) PWM Configuration Control                                  */
    
    struct {
      __IOM uint16_t PWM_BNK    : 3;            /*!< [2..0] Internal PWM generator selection                                   */
            uint16_t            : 1;
      __IOM uint16_t PWM_DC     : 10;           /*!< [13..4] PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB)                  */
      __IOM uint16_t PWM_FREQ   : 1;            /*!< [14..14] PWM generator Frequency Setting                                  */
            uint16_t            : 1;
    } bit;
  } PWM_CTRL_BNK2;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000001A) PWM Configuration Control                                  */
    
    struct {
      __IOM uint16_t PWM_BNK    : 3;            /*!< [2..0] Internal PWM generator selection                                   */
            uint16_t            : 1;
      __IOM uint16_t PWM_DC     : 10;           /*!< [13..4] PWM Duty Cycle Setting (bit4 = LSB; bit13 = MSB)                  */
      __IOM uint16_t PWM_FREQ   : 1;            /*!< [14..14] PWM generator Frequency Setting                                  */
            uint16_t            : 1;
    } bit;
  } PWM_CTRL_BNK3;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000001C) System Status Control                                      */
    
    struct {
      __IOM uint16_t SYS_STAT   : 16;           /*!< [15..0] System Status Control (bit0=LSB; bit15=MSB) Dedicated
                                                     bytes for system configuration, access only by microcontroller.
                                                     Cleared after power up and soft reset.                                    */
    } bit;
  } SYS_STAT_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000001E) General Bridge Control                                     */
    
    struct {
      __IOM uint16_t FMODE      : 1;            /*!< [0..0] Frequency modulation of the charge pump                            */
      __IOM uint16_t IHOLD      : 1;            /*!< [1..1] Gate driver hold current IHOLD                                     */
      __IOM uint16_t EN_GEN_CHECK : 1;          /*!< [2..2] Detection of active / FW MOSFET                                    */
      __IOM uint16_t AGCFILT    : 1;            /*!< [3..3] Filter for adaptive gate control                                   */
      __IOM uint16_t POCHGDIS   : 1;            /*!< [4..4] Postcharge disable bit                                             */
      __IOM uint16_t CPEN       : 1;            /*!< [5..5] CPEN                                                               */
      __IOM uint16_t AGC        : 2;            /*!< [7..6] Adaptive gate control                                              */
      __IOM uint16_t IPCHGADT   : 1;            /*!< [8..8] Adaptation of the pre-charge and pre-discharge current             */
      __IOM uint16_t BDOV_REC   : 1;            /*!< [9..9] Bridge driver recover from VS and VSINT Overvoltage                */
      __IOM uint16_t CPSTGA     : 1;            /*!< [10..10] Automatic switchover between dual and single charge
                                                     pump stage                                                                */
      __IOM uint16_t FET_LVL    : 1;            /*!< [11..11] External MOSFET normal / logic level selection                   */
      __IOM uint16_t CPUVTH     : 1;            /*!< [12..12] Charge pump under voltage (referred to VS)                       */
            uint16_t            : 2;
      __IOM uint16_t BDFREQ     : 1;            /*!< [15..15] Bridge driver synchronization frequency                          */
    } bit;
  } GENCTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000020) Current sense amplifier                                    */
    
