jassony/infineon2b6/TLE9563_LLD/inc/TLE9563.h
    struct {
      __IOM uint16_t OCEN       : 1;            /*!< [0..0] Overcurrent shutdown Enable                                        */
      __IOM uint16_t CSAG       : 2;            /*!< [2..1] Gain of the current sense amplifier                                */
      __IOM uint16_t OCTH       : 2;            /*!< [4..3] Overcurrent detection threshold of CSO                             */
      __IOM uint16_t CSA_OFF    : 1;            /*!< [5..5] CSA OFF                                                            */
      __IOM uint16_t OCFILT     : 2;            /*!< [7..6] Overcurrent filter time of CSO                                     */
      __IOM uint16_t CSD        : 1;            /*!< [8..8] Direction of the current sense amplifier                           */
      __IOM uint16_t CSO_CAP    : 1;            /*!< [9..9] Capacitance connected to the current sense amplifier
                                                     output (CCSO), see also Chapter 12.12.4                                   */
      __IOM uint16_t PWM_NB     : 1;            /*!< [10..10] Selection of 3 or 6 PWM inputs                                   */
            uint16_t            : 5;
    } bit;
  } CSA;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000022) VDS monitoring threshold LS1-3                             */
    
    struct {
      __IOM uint16_t LS1VDSTH   : 3;            /*!< [2..0] LS1 drain-source overvoltage threshold                             */
      __IOM uint16_t LS2VDSTH   : 3;            /*!< [5..3] LS2 drain-source overvoltage threshold                             */
      __IOM uint16_t LS3VDSTH   : 3;            /*!< [8..6] LS3 drain-source overvoltage threshold                             */
            uint16_t            : 3;
      __IOM uint16_t TFVDS      : 2;            /*!< [13..12] Filter time of drain-source voltage monitoring                   */
            uint16_t            : 2;
    } bit;
  } LS_VDS;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000024) VDS monitoring threshold HS1-3                             */
    
    struct {
      __IOM uint16_t HS1VDSTH   : 3;            /*!< [2..0] HS1 drain-source overvoltage threshold                             */
      __IOM uint16_t HS2VDSTH   : 3;            /*!< [5..3] HS2 drain-source overvoltage threshold                             */
      __IOM uint16_t HS3VDSTH   : 3;            /*!< [8..6] HS3 drain-source overvoltage threshold                             */
            uint16_t            : 3;
      __IOM uint16_t DEEP_ADAP  : 1;            /*!< [12..12] Deep adaptation enable                                           */
            uint16_t            : 3;
    } bit;
  } HS_VDS;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000026) CCP and times selection                                    */
    
    struct {
      __IOM uint16_t CCP_BNK    : 3;            /*!< [2..0] Cross-current and time banking                                     */
            uint16_t            : 5;
      __IOM uint16_t TCCP       : 4;            /*!< [11..8] Cross-current protection time                                     */
      __IOM uint16_t TBLANK     : 4;            /*!< [15..12] Blank time                                                       */
    } bit;
  } CCP_BLK_BNK0;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000028) CCP and times selection                                    */
    
    struct {
      __IOM uint16_t CCP_BNK    : 3;            /*!< [2..0] Cross-current and time banking                                     */
            uint16_t            : 5;
      __IOM uint16_t TCCP       : 4;            /*!< [11..8] Cross-current protection time                                     */
      __IOM uint16_t TBLANK     : 4;            /*!< [15..12] Blank time                                                       */
    } bit;
  } CCP_BLK_BNK1;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000002A) CCP and times selection                                    */
    
    struct {
      __IOM uint16_t CCP_BNK    : 3;            /*!< [2..0] Cross-current and time banking                                     */
            uint16_t            : 5;
      __IOM uint16_t TCCP       : 4;            /*!< [11..8] Cross-current protection time                                     */
      __IOM uint16_t TBLANK     : 4;            /*!< [15..12] Blank time                                                       */
    } bit;
  } CCP_BLK_BNK2;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000002C) CCP and times selection                                    */
    
    struct {
      __IOM uint16_t CCP_BNK    : 3;            /*!< [2..0] Cross-current and time banking                                     */
            uint16_t            : 5;
      __IOM uint16_t TCCP       : 4;            /*!< [11..8] Cross-current protection time                                     */
      __IOM uint16_t TBLANK     : 4;            /*!< [15..12] Blank time                                                       */
    } bit;
  } CCP_BLK_BNK4;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000002E) CCP and times selection                                    */
    
    struct {
      __IOM uint16_t CCP_BNK    : 3;            /*!< [2..0] Cross-current and time banking                                     */
            uint16_t            : 5;
      __IOM uint16_t TCCP       : 4;            /*!< [11..8] Cross-current protection time                                     */
      __IOM uint16_t TBLANK     : 4;            /*!< [15..12] Blank time                                                       */
    } bit;
  } CCP_BLK_BNK5;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000030) CCP and times selection                                    */
    
