jassony/infineon2b6/TLE9563_LLD/inc/TLE9563.h
    struct {
      __IOM uint16_t CCP_BNK    : 3;            /*!< [2..0] Cross-current and time banking                                     */
            uint16_t            : 5;
      __IOM uint16_t TCCP       : 4;            /*!< [11..8] Cross-current protection time                                     */
      __IOM uint16_t TBLANK     : 4;            /*!< [15..12] Blank time                                                       */
    } bit;
  } CCP_BLK_BNK6;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000032) Half-Bridge MODE                                           */
    
    struct {
      __IOM uint16_t HB1_PWM_EN : 1;            /*!< [0..0] PWM mode for half-bridge 1                                         */
      __IOM uint16_t AFW1       : 1;            /*!< [1..1] Active freewheeling for half-bridge 1 during PWM                   */
      __IOM uint16_t HB1MODE    : 2;            /*!< [3..2] Half-bridge 1 MODE selection                                       */
      __IOM uint16_t HB2_PWM_EN : 1;            /*!< [4..4] PWM mode for half-bridge 2                                         */
      __IOM uint16_t AFW2       : 1;            /*!< [5..5] Active freewheeling for half-bridge 2 during PWM                   */
      __IOM uint16_t HB2MODE    : 2;            /*!< [7..6] Half-bridge 2 MODE selection                                       */
      __IOM uint16_t HB3_PWM_EN : 1;            /*!< [8..8] PWM mode for half-bridge 3                                         */
      __IOM uint16_t AFW3       : 1;            /*!< [9..9] Active freewheeling for half-bridge 3 during PWM                   */
      __IOM uint16_t HB3MODE    : 2;            /*!< [11..10] Half-bridge 3 MODE selection                                     */
            uint16_t            : 4;
    } bit;
  } HBMODE;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000034) HB pre-charge and pre-discharge time                       */
    
    struct {
      __IOM uint16_t TPCHG_BNK  : 3;            /*!< [2..0] Precharge/predischarge time selection                              */
            uint16_t            : 1;
      __IOM uint16_t TPCHG1     : 3;            /*!< [6..4] If TPCHG_BNK=0 precharge time of HB 1, If TPCHG_BNK=1
                                                     predischarge time of HB 1                                                 */
      __IOM uint16_t TPCHG2     : 3;            /*!< [9..7] If TPCHG_BNK=0 precharge time of HB 2, If TPCHG_BNK=1
                                                     predischarge time of HB 2                                                 */
      __IOM uint16_t TPCHG3     : 3;            /*!< [12..10] If TPCHG_BNK=0 precharge time of HB 3, If TPCHG_BNK=1
                                                     predischarge time of HB 3                                                 */
            uint16_t            : 3;
    } bit;
  } TPRECHG_BNK0;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000036) HB pre-charge and pre-discharge time                       */
    
    struct {
      __IOM uint16_t TPCHG_BNK  : 3;            /*!< [2..0] Precharge/predischarge time selection                              */
            uint16_t            : 1;
      __IOM uint16_t TPCHG1     : 3;            /*!< [6..4] If TPCHG_BNK=0 precharge time of HB 1, If TPCHG_BNK=1
                                                     predischarge time of HB 1                                                 */
      __IOM uint16_t TPCHG2     : 3;            /*!< [9..7] If TPCHG_BNK=0 precharge time of HB 2, If TPCHG_BNK=1
                                                     predischarge time of HB 2                                                 */
      __IOM uint16_t TPCHG3     : 3;            /*!< [12..10] If TPCHG_BNK=0 precharge time of HB 3, If TPCHG_BNK=1
                                                     predischarge time of HB 3                                                 */
            uint16_t            : 3;
    } bit;
  } TPRECHG_BNK1;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000038) Static charge/discharge current                            */
    
    struct {
      __IOM uint16_t ICHGST1    : 4;            /*!< [3..0] Static charge and discharge currents of HB1                        */
      __IOM uint16_t ICHGST2    : 4;            /*!< [7..4] Static charge and discharge currents of HB2                        */
      __IOM uint16_t ICHGST3    : 4;            /*!< [11..8] Static charge and discharge currents of HB3                       */
            uint16_t            : 4;
    } bit;
  } ST_ICHG;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000003A) HB charge/discharge currents for PWM operation             */
    
    struct {
      __IOM uint16_t ICHG_BNK   : 3;            /*!< [2..0] Banking bits for charge and discharge currents of active
                                                     MOSFETs                                                                   */
            uint16_t            : 1;
      __IOM uint16_t ICHG       : 6;            /*!< [9..4] If ICHG_BNK=0xxB Charge current of HBx active MOSFET               */
      __IOM uint16_t IDCHG      : 6;            /*!< [15..10] If ICHG_BNK =0xxB Discharge current of HBx active MOSFET         */
    } bit;
  } HB_ICHG_BNK0;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000003C) HB charge/discharge currents for PWM operation             */
    
    struct {
      __IOM uint16_t ICHG_BNK   : 3;            /*!< [2..0] Banking bits for charge and discharge currents of active
                                                     MOSFETs                                                                   */
            uint16_t            : 1;
      __IOM uint16_t ICHG       : 6;            /*!< [9..4] If ICHG_BNK=0xxB Charge current of HBx active MOSFET               */
      __IOM uint16_t IDCHG      : 6;            /*!< [15..10] If ICHG_BNK =0xxB Discharge current of HBx active MOSFET         */
    } bit;
  } HB_ICHG_BNK1;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000003E) HB charge/discharge currents for PWM operation             */
    
