jassony/infineon2b6/TLE9563_LLD/inc/TLE9563.h
    struct {
      __IOM uint16_t ICHG_BNK   : 3;            /*!< [2..0] Banking bits for charge and discharge currents of active
                                                     MOSFETs                                                                   */
            uint16_t            : 1;
      __IOM uint16_t ICHG       : 6;            /*!< [9..4] If ICHG_BNK=0xxB Charge current of HBx active MOSFET               */
      __IOM uint16_t IDCHG      : 6;            /*!< [15..10] If ICHG_BNK =0xxB Discharge current of HBx active MOSFET         */
    } bit;
  } HB_ICHG_BNK2;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000040) HB charge/discharge currents for PWM operation             */
    
    struct {
      __IOM uint16_t ICHG_BNK   : 3;            /*!< [2..0] Banking bits for charge and discharge currents of active
                                                     MOSFETs                                                                   */
            uint16_t            : 1;
      __IOM uint16_t ICHG       : 6;            /*!< [9..4] If ICHG_BNK=0xxB Charge current of HBx active MOSFET               */
      __IOM uint16_t IDCHG      : 6;            /*!< [15..10] If ICHG_BNK =0xxB Discharge current of HBx active MOSFET         */
    } bit;
  } HB_ICHG_BNK4;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000042) HB charge/discharge currents for PWM operation             */
    
    struct {
      __IOM uint16_t ICHG_BNK   : 3;            /*!< [2..0] Banking bits for charge and discharge currents of active
                                                     MOSFETs                                                                   */
            uint16_t            : 1;
      __IOM uint16_t ICHG       : 6;            /*!< [9..4] If ICHG_BNK=0xxB Charge current of HBx active MOSFET               */
      __IOM uint16_t IDCHG      : 6;            /*!< [15..10] If ICHG_BNK =0xxB Discharge current of HBx active MOSFET         */
    } bit;
  } HB_ICHG_BNK5;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000044) HB charge/discharge currents for PWM operation             */
    
    struct {
      __IOM uint16_t ICHG_BNK   : 3;            /*!< [2..0] Banking bits for charge and discharge currents of active
                                                     MOSFETs                                                                   */
            uint16_t            : 1;
      __IOM uint16_t ICHG       : 6;            /*!< [9..4] If ICHG_BNK=0xxB Charge current of HBx active MOSFET               */
      __IOM uint16_t IDCHG      : 6;            /*!< [15..10] If ICHG_BNK =0xxB Discharge current of HBx active MOSFET         */
    } bit;
  } HB_ICHG_BNK6;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000046) HB max. pre-charge/pre-discharge in PWM operation
                                                                    current and diagnostic pull-down                           */
    
    struct {
      __IOM uint16_t ICHGMAX1   : 2;            /*!< [1..0] Maximum drive current of HB1 during the pre-charge and
                                                     pre-discharge phases1)                                                    */
      __IOM uint16_t ICHGMAX2   : 2;            /*!< [3..2] Maximum drive current of HB2 during the pre-charge phase
                                                     and pre-discharge phases1)                                                */
      __IOM uint16_t ICHGMAX3   : 2;            /*!< [5..4] Maximum drive current of HB3 during the pre-charge and
                                                     pre-discharge phases1)                                                    */
            uint16_t            : 6;
      __IOM uint16_t HB1IDIAG   : 1;            /*!< [12..12] Control of HB1 pull-down for off-state diagnostic                */
      __IOM uint16_t HB2IDIAG   : 1;            /*!< [13..13] Control of HB2 pull-down for off-state diagnostic                */
      __IOM uint16_t HB3IDIAG   : 1;            /*!< [14..14] Control of HB3 off-state current source and current
                                                     sink                                                                      */
            uint16_t            : 1;
    } bit;
  } HB_ICHG_MAX;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000048) HBx pre-charge/pre-discharge initialization configuration
                                                                    in PWM operation                                           */
    
    struct {
      __IOM uint16_t INIT_BNK   : 3;            /*!< [2..0] Banking bits for Precharge an Predischarge Initial                 */
            uint16_t            : 1;
      __IOM uint16_t PCHGINIT   : 6;            /*!< [9..4] Initial precharge current of HBx, IPCHGINITx The INIT_BNK
                                                     bits select the addressed half-bridge Default 001101B Refer
                                                     to Table 34                                                               */
      __IOM uint16_t PDCHGINIT  : 6;            /*!< [15..10] Initial predischarge current of HBx, IPDCHGINITx The
                                                     INIT_BNK bits select the addressed half-bridge Default
                                                     001111B                                                                   */
    } bit;
  } HB_PCHG_INIT_BNK0;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000004A) HBx pre-charge/pre-discharge initialization configuration
                                                                    in PWM operation                                           */
    
    struct {
      __IOM uint16_t INIT_BNK   : 3;            /*!< [2..0] Banking bits for Precharge an Predischarge Initial                 */
            uint16_t            : 1;
      __IOM uint16_t PCHGINIT   : 6;            /*!< [9..4] Initial precharge current of HBx, IPCHGINITx The INIT_BNK
                                                     bits select the addressed half-bridge Default 001101B Refer
                                                     to Table 34                                                               */
      __IOM uint16_t PDCHGINIT  : 6;            /*!< [15..10] Initial predischarge current of HBx, IPDCHGINITx The
                                                     INIT_BNK bits select the addressed half-bridge Default
                                                     001111B                                                                   */
    } bit;
  } HB_PCHG_INIT_BNK1;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000004C) HBx pre-charge/pre-discharge initialization configuration
                                                                    in PWM operation                                           */
    
