jassony/infineon2b6/TLE9563_LLD/inc/TLE9563.h
    struct {
      __IOM uint16_t INIT_BNK   : 3;            /*!< [2..0] Banking bits for Precharge an Predischarge Initial                 */
            uint16_t            : 1;
      __IOM uint16_t PCHGINIT   : 6;            /*!< [9..4] Initial precharge current of HBx, IPCHGINITx The INIT_BNK
                                                     bits select the addressed half-bridge Default 001101B Refer
                                                     to Table 34                                                               */
      __IOM uint16_t PDCHGINIT  : 6;            /*!< [15..10] Initial predischarge current of HBx, IPDCHGINITx The
                                                     INIT_BNK bits select the addressed half-bridge Default
                                                     001111B                                                                   */
    } bit;
  } HB_PCHG_INIT_BNK2;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000004E) HBx inputs TDON configuration                              */
    
    struct {
      __IOM uint16_t HB_TDON_BNK : 3;           /*!< [2..0] Banking bits for turn-on delay time                                */
            uint16_t            : 5;
      __IOM uint16_t TDON       : 6;            /*!< [13..8] Turn-on delay time of active MOSFET of HBx                        */
            uint16_t            : 2;
    } bit;
  } TDON_HB_CTRL_BNK0;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000050) HBx inputs TDON configuration                              */
    
    struct {
      __IOM uint16_t HB_TDON_BNK : 3;           /*!< [2..0] Banking bits for turn-on delay time                                */
            uint16_t            : 5;
      __IOM uint16_t TDON       : 6;            /*!< [13..8] Turn-on delay time of active MOSFET of HBx                        */
            uint16_t            : 2;
    } bit;
  } TDON_HB_CTRL_BNK1;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000052) HBx inputs TDON configuration                              */
    
    struct {
      __IOM uint16_t HB_TDON_BNK : 3;           /*!< [2..0] Banking bits for turn-on delay time                                */
            uint16_t            : 5;
      __IOM uint16_t TDON       : 6;            /*!< [13..8] Turn-on delay time of active MOSFET of HBx                        */
            uint16_t            : 2;
    } bit;
  } TDON_HB_CTRL_BNK2;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000054) HBx TDOFF configuration                                    */
    
    struct {
      __IOM uint16_t HB_TDOFF_BNK : 3;          /*!< [2..0] Banking bits for turn-off delay time                               */
            uint16_t            : 5;
      __IOM uint16_t TDOFF      : 6;            /*!< [13..8] Turn-off delay time of active MOSFET of HBx The HB_TDOFF_BNK
                                                     bits selects the turn-off delay time of the active MOSFET
                                                     of the half-bridge HBx Nominal tDOFF = 53.3 ns x TDOFF[50]D               */
            uint16_t            : 2;
    } bit;
  } TDOFF_HB_CTRL_BNK0;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000056) HBx TDOFF configuration                                    */
    
    struct {
      __IOM uint16_t HB_TDOFF_BNK : 3;          /*!< [2..0] Banking bits for turn-off delay time                               */
            uint16_t            : 5;
      __IOM uint16_t TDOFF      : 6;            /*!< [13..8] Turn-off delay time of active MOSFET of HBx The HB_TDOFF_BNK
                                                     bits selects the turn-off delay time of the active MOSFET
                                                     of the half-bridge HBx Nominal tDOFF = 53.3 ns x TDOFF[50]D               */
            uint16_t            : 2;
    } bit;
  } TDOFF_HB_CTRL_BNK1;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000058) HBx TDOFF configuration                                    */
    
    struct {
      __IOM uint16_t HB_TDOFF_BNK : 3;          /*!< [2..0] Banking bits for turn-off delay time                               */
            uint16_t            : 5;
      __IOM uint16_t TDOFF      : 6;            /*!< [13..8] Turn-off delay time of active MOSFET of HBx The HB_TDOFF_BNK
                                                     bits selects the turn-off delay time of the active MOSFET
                                                     of the half-bridge HBx Nominal tDOFF = 53.3 ns x TDOFF[50]D               */
            uint16_t            : 2;
    } bit;
  } TDOFF_HB_CTRL_BNK2;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000005A) Brake control                                              */
    
    struct {
      __IOM uint16_t OV_BRK_TH  : 3;            /*!< [2..0] Overvoltage brake threshold                                        */
            uint16_t            : 2;
      __IOM uint16_t OV_BRK_EN  : 1;            /*!< [5..5] Overvoltage brake enable                                           */
      __IOM uint16_t PARK_BRK_EN : 1;           /*!< [6..6] Parking brake enable                                               */
      __IOM uint16_t TBLK_BRK   : 1;            /*!< [7..7] Blank time of VDS overvoltage during braking                       */
      __IOM uint16_t VDSTH_BRK  : 1;            /*!< [8..8] VDS Overvoltage for LS1-3 during braking                           */
      __IOM uint16_t SLAM       : 1;            /*!< [9..9] Slam mode                                                          */
      __IOM uint16_t SLAM_LS1_DIS : 1;          /*!< [10..10] LS1 output disable during SLAM mode                              */
      __IOM uint16_t SLAM_LS2_DIS : 1;          /*!< [11..11] LS2 output disable during SLAM mode                              */
      __IOM uint16_t SLAM_LS3_DIS : 1;          /*!< [12..12] LS3 output disable during SLAM mode                              */
            uint16_t            : 3;
    } bit;
  } BRAKE;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000005C) CAN Selective Wake Control                                 */
    
