jassony/infineon2b6/TLE9563_LLD/inc/TLE9563.h
    struct {
      __IOM uint16_t CFG_VAL    : 1;            /*!< [0..0] SWK Configuration valid                                            */
            uint16_t            : 3;
      __IOM uint16_t CANTO_MASK : 1;            /*!< [4..4] CAN Time Out Masking                                               */
      __IOM uint16_t TRIM_EN    : 2;            /*!< [6..5] (Un)locking mechanism of oscillator recalibration                  */
      __IOM uint16_t OSC_CAL    : 1;            /*!< [7..7] Oscillator Calibration Mode                                        */
            uint16_t            : 8;
    } bit;
  } SWK_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000005E) SWK Bit Timing Control                                     */
    
    struct {
      __IOM uint16_t TBIT       : 8;            /*!< [7..0] Number of Time Quanta in a Bit Time                                */
            uint16_t            : 2;
      __IOM uint16_t SP         : 6;            /*!< [15..10] Sampling Point Position                                          */
    } bit;
  } SWK_BTL1_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000060) SWK WUF Identifier bits 28...13                            */
    
    struct {
      __IOM uint16_t ID13       : 1;            /*!< [0..0] WUF Identifier Bit 13                                              */
      __IOM uint16_t ID14       : 1;            /*!< [1..1] WUF Identifier Bit 14                                              */
      __IOM uint16_t ID15       : 1;            /*!< [2..2] WUF Identifier Bit 15                                              */
      __IOM uint16_t ID16       : 1;            /*!< [3..3] WUF Identifier Bit 16                                              */
      __IOM uint16_t ID17       : 1;            /*!< [4..4] WUF Identifier Bit 17                                              */
      __IOM uint16_t ID18       : 1;            /*!< [5..5] WUF Identifier Bit 18                                              */
      __IOM uint16_t ID19       : 1;            /*!< [6..6] WUF Identifier Bit 19                                              */
      __IOM uint16_t ID20       : 1;            /*!< [7..7] WUF Identifier Bit 20                                              */
      __IOM uint16_t ID21       : 1;            /*!< [8..8] WUF Identifier Bit 21                                              */
      __IOM uint16_t ID22       : 1;            /*!< [9..9] WUF Identifier Bit 22                                              */
      __IOM uint16_t ID23       : 1;            /*!< [10..10] WUF Identifier Bit 23                                            */
      __IOM uint16_t ID24       : 1;            /*!< [11..11] WUF Identifier Bit 24                                            */
      __IOM uint16_t ID25       : 1;            /*!< [12..12] WUF Identifier Bit 25                                            */
      __IOM uint16_t ID26       : 1;            /*!< [13..13] WUF Identifier Bit 26                                            */
      __IOM uint16_t ID27       : 1;            /*!< [14..14] WUF Identifier Bit 27                                            */
      __IOM uint16_t ID28       : 1;            /*!< [15..15] WUF Identifier Bit 28                                            */
    } bit;
  } SWK_ID1_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000062) SWK WUF Identifier bits 12...0                             */
    
    struct {
      __IOM uint16_t IDE        : 1;            /*!< [0..0] Identifier Extension Bit                                           */
      __IOM uint16_t RTR        : 1;            /*!< [1..1] Remote Transmission Request Field (acc. ISO11898-22016)            */
      __IOM uint16_t ID0        : 1;            /*!< [2..2] WUF Identifier Bit 0                                               */
      __IOM uint16_t ID1        : 1;            /*!< [3..3] WUF Identifier Bit 1                                               */
      __IOM uint16_t ID2        : 1;            /*!< [4..4] WUF Identifier Bit 2                                               */
      __IOM uint16_t ID3        : 1;            /*!< [5..5] WUF Identifier Bit 3                                               */
      __IOM uint16_t ID4        : 1;            /*!< [6..6] WUF Identifier Bit 4                                               */
            uint16_t            : 1;
      __IOM uint16_t ID5        : 1;            /*!< [8..8] WUF Identifier Bit 5                                               */
      __IOM uint16_t ID6        : 1;            /*!< [9..9] WUF Identifier Bit 6                                               */
      __IOM uint16_t ID7        : 1;            /*!< [10..10] WUF Identifier Bit 7                                             */
      __IOM uint16_t ID8        : 1;            /*!< [11..11] WUF Identifier Bit 8                                             */
      __IOM uint16_t ID9        : 1;            /*!< [12..12] WUF Identifier Bit 9                                             */
      __IOM uint16_t ID10       : 1;            /*!< [13..13] WUF Identifier Bit 10                                            */
      __IOM uint16_t ID11       : 1;            /*!< [14..14] WUF Identifier Bit 11                                            */
      __IOM uint16_t ID12       : 1;            /*!< [15..15] WUF Identifier Bit 12                                            */
    } bit;
  } SWK_ID0_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000064) SWK WUF Identifier Mask bits 28...13                       */
    
    struct {
      __IOM uint16_t MASK_ID13  : 1;            /*!< [0..0] WUF Identifier Mask Bit 13                                         */
      __IOM uint16_t MASK_ID14  : 1;            /*!< [1..1] WUF Identifier Mask Bit 14                                         */
      __IOM uint16_t MASK_ID15  : 1;            /*!< [2..2] WUF Identifier Mask Bit 15                                         */
      __IOM uint16_t MASK_ID16  : 1;            /*!< [3..3] WUF Identifier Mask Bit 16                                         */
      __IOM uint16_t MASK_ID17  : 1;            /*!< [4..4] WUF Identifier Mask Bit 17                                         */
      __IOM uint16_t MASK_ID18  : 1;            /*!< [5..5] WUF Identifier Mask Bit 18                                         */
      __IOM uint16_t MASK_ID19  : 1;            /*!< [6..6] WUF Identifier Mask Bit 19                                         */
      __IOM uint16_t MASK_ID20  : 1;            /*!< [7..7] WUF Identifier Mask Bit 20                                         */
      __IOM uint16_t MASK_ID21  : 1;            /*!< [8..8] WUF Identifier Mask Bit 21                                         */
      __IOM uint16_t MASK_ID22  : 1;            /*!< [9..9] WUF Identifier Mask Bit 22                                         */
      __IOM uint16_t MASK_ID23  : 1;            /*!< [10..10] WUF Identifier Mask Bit 23                                       */
      __IOM uint16_t MASK_ID24  : 1;            /*!< [11..11] WUF Identifier Mask Bit 24                                       */
      __IOM uint16_t MASK_ID25  : 1;            /*!< [12..12] WUF Identifier Mask Bit 25                                       */
      __IOM uint16_t MASK_ID26  : 1;            /*!< [13..13] WUF Identifier Mask Bit 26                                       */
      __IOM uint16_t MASK_ID27  : 1;            /*!< [14..14] WUF Identifier Mask Bit 27                                       */
      __IOM uint16_t MASK_ID28  : 1;            /*!< [15..15] WUF Identifier Mask Bit 28                                       */
    } bit;
  } SWK_MASK_ID1_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000066) SWK WUF Identifier Mask bits 12...0                        */
    
