jassony/infineon2b6/TLE9563_LLD/inc/TLE9563.h
    struct {
            uint16_t            : 2;
      __IOM uint16_t MASK_ID0   : 1;            /*!< [2..2] WUF Identifier Mask Bit 0                                          */
      __IOM uint16_t MASK_ID1   : 1;            /*!< [3..3] WUF Identifier Mask Bit 1                                          */
      __IOM uint16_t MASK_ID2   : 1;            /*!< [4..4] WUF Identifier Mask Bit 2                                          */
      __IOM uint16_t MASK_ID3   : 1;            /*!< [5..5] WUF Identifier Mask Bit 3                                          */
      __IOM uint16_t MASK_ID4   : 1;            /*!< [6..6] WUF Identifier Mask Bit 4                                          */
            uint16_t            : 1;
      __IOM uint16_t MASK_ID5   : 1;            /*!< [8..8] WUF Identifier Mask Bit 5                                          */
      __IOM uint16_t MASK_ID6   : 1;            /*!< [9..9] WUF Identifier Mask Bit 6                                          */
      __IOM uint16_t MASK_ID7   : 1;            /*!< [10..10] WUF Identifier Mask Bit 7                                        */
      __IOM uint16_t MASK_ID8   : 1;            /*!< [11..11] WUF Identifier Mask Bit 8                                        */
      __IOM uint16_t MASK_ID9   : 1;            /*!< [12..12] WUF Identifier Mask Bit 9                                        */
      __IOM uint16_t MASK_ID10  : 1;            /*!< [13..13] WUF Identifier Mask Bit 10                                       */
      __IOM uint16_t MASK_ID11  : 1;            /*!< [14..14] WUF Identifier Mask Bit 11                                       */
      __IOM uint16_t MASK_ID12  : 1;            /*!< [15..15] WUF Identifier Mask Bit 12                                       */
    } bit;
  } SWK_MASK_ID0_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000068) SWK Frame Data Length Code Control                         */
    
    struct {
      __IOM uint16_t DLC        : 4;            /*!< [3..0] Payload length in number of bytes                                  */
            uint16_t            : 12;
    } bit;
  } SWK_DLC_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000006A) SWK Data7-Data6 Register                                   */
    
    struct {
      __IOM uint16_t DATA6      : 8;            /*!< [7..0] Data6 byte content(bit0=LSB; bit7=MSB)                             */
      __IOM uint16_t DATA7      : 8;            /*!< [15..8] Data7 byte content(bit0=LSB; bit7=MSB)                            */
    } bit;
  } SWK_DATA3_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000006C) SWK Data5-Data4 Register                                   */
    
    struct {
      __IOM uint16_t DATA4      : 8;            /*!< [7..0] Data4 byte content(bit0=LSB; bit7=MSB)                             */
      __IOM uint16_t DATA5      : 8;            /*!< [15..8] Data5 byte content(bit0=LSB; bit7=MSB)                            */
    } bit;
  } SWK_DATA2_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000006E) SWK Data3-Data2 Register                                   */
    
    struct {
      __IOM uint16_t DATA2      : 8;            /*!< [7..0] Data2 byte content(bit0=LSB; bit7=MSB)                             */
      __IOM uint16_t DATA3      : 8;            /*!< [15..8] Data3 byte content(bit0=LSB; bit7=MSB)                            */
    } bit;
  } SWK_DATA1_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000070) SWK Data1-Data0 Register                                   */
    
    struct {
      __IOM uint16_t DATA0      : 8;            /*!< [7..0] Data0 byte content(bit0=LSB; bit7=MSB)                             */
      __IOM uint16_t DATA1      : 8;            /*!< [15..8] Data1 byte content(bit0=LSB; bit7=MSB)                            */
    } bit;
  } SWK_DATA0_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000072) CAN FD Configuration Control Register                      */
    
    struct {
      __IOM uint16_t CAN_FD_EN  : 1;            /*!< [0..0] Enable CAN FD Tolerant Mode                                        */
      __IOM uint16_t FD_FILTER  : 3;            /*!< [3..1] CAN FD Dominant Filter Time                                        */
            uint16_t            : 1;
      __IOM uint16_t DIS_ERR_CNT : 1;           /*!< [5..5] Error Counter Disable Function                                     */
            uint16_t            : 10;
    } bit;
  } SWK_CAN_FD_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000074) SWK Oscillator Trimming and option Register                */
    
    struct {
      __IOM uint16_t TRIM_OSC   : 7;            /*!< [6..0] Trimming of oscillator (only writable if                           */
      __IOM uint16_t TEMP_COEF  : 5;            /*!< [11..7] Trimming of temp_coef (only writable if TRIM_EN = '11')           */
            uint16_t            : 2;
      __IOM uint16_t RX_WK_SEL  : 1;            /*!< [14..14] SWK Receiver selection (only accessible if TRIM_EN
                                                     = '11')                                                                   */
            uint16_t            : 1;
    } bit;
  } SWK_OSC_TRIM_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000076) SWK Oscillator Calibration Register                        */
    
    struct {
      __IM  uint16_t OSC_CAL_L  : 8;            /*!< [7..0] Oscillator Calibration Low Register                                */
      __IM  uint16_t OSC_CAL_H  : 8;            /*!< [15..8] Oscillator Calibration High Register                              */
    } bit;
  } SWK_OSC_CAL_STAT;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000078) Clock Data Recovery Control Register                       */
    
