jassony/infineon2b6/TLE9563_LLD/inc/TLE9563.h
    struct {
      __IOM uint16_t CDR_EN     : 1;            /*!< [0..0] Enable CDR                                                         */
            uint16_t            : 1;
      __IOM uint16_t SELFILT    : 2;            /*!< [3..2] Select Time Constant of Filter                                     */
            uint16_t            : 1;
      __IOM uint16_t SEL_OSC_CLK : 2;           /*!< [6..5] Input Frequency for CDR module                                     */
            uint16_t            : 9;
    } bit;
  } SWK_CDR_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000007A) SWK Clock Data Recovery Limit Control                      */
    
    struct {
      __IOM uint16_t CDR_LIM_L  : 8;            /*!< [7..0] Lower Bit Time Detection Range of Clock and Data                   */
      __IOM uint16_t CDR_LIM_H  : 8;            /*!< [15..8] Upper Bit Time Detection Range of Clock and Data                  */
    } bit;
  } SWK_CDR_LIMIT;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000007C) Supply Voltage Fail Status                                 */
    
    struct {
      __IOM uint16_t VCC1_WARN  : 1;            /*!< [0..0] VCC1 Undervoltage Prewarning                                       */
      __IOM uint16_t VCC1_OV    : 1;            /*!< [1..1] VCC1 Overvoltage Detection                                         */
      __IOM uint16_t VCC1_UV    : 1;            /*!< [2..2] VCC1 UV-Detection (due to Vrtx reset)                              */
      __IOM uint16_t VCC1_SC    : 1;            /*!< [3..3] VCC1 SC                                                            */
      __IOM uint16_t CP_UV      : 1;            /*!< [4..4] CP_UV                                                              */
      __IOM uint16_t VS_OV      : 1;            /*!< [5..5] VS Overvoltage Detection (VS,OV)                                   */
      __IOM uint16_t VS_UV      : 1;            /*!< [6..6] VS Undervoltage Detection (VS,UV)                                  */
      __IOM uint16_t VSINT_OV   : 1;            /*!< [7..7] VSINT OV-Detection                                                 */
      __IOM uint16_t VSINT_UV   : 1;            /*!< [8..8] VSINT UV-Detection                                                 */
      __IOM uint16_t HS_OV      : 1;            /*!< [9..9] HS Supply OV-Detection                                             */
      __IOM uint16_t HS_UV      : 1;            /*!< [10..10] HS Supply UV-Detection                                           */
      __IOM uint16_t VCC1_UV_FS : 1;            /*!< [11..11] 4th consecutive VCC1 UV-Detection                                */
      __IOM uint16_t CP_OT      : 1;            /*!< [12..12] Charge pump overtemperature                                      */
            uint16_t            : 2;
      __IOM uint16_t POR        : 1;            /*!< [15..15] Power-On reset detection                                         */
    } bit;
  } SUP_STAT;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000007E) Thermal Protection Status                                  */
    
    struct {
      __IOM uint16_t TPW        : 1;            /*!< [0..0] Thermal Pre Warning                                                */
      __IOM uint16_t TSD1       : 1;            /*!< [1..1] TSD1 Thermal Shut-Down Detection                                   */
      __IOM uint16_t TSD2       : 1;            /*!< [2..2] TSD2 Thermal Shut-Down Detection                                   */
      __IOM uint16_t TSD2_SAFE  : 1;            /*!< [3..3] TSD2 Thermal Shut-Down Safe State Detection                        */
            uint16_t            : 12;
    } bit;
  } THERM_STAT;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000080) Device Information Status                                  */
    
    struct {
      __IOM uint16_t FAILURE    : 1;            /*!< [0..0] Failure detection                                                  */
      __IOM uint16_t SPI_FAIL   : 1;            /*!< [1..1] SPI Fail Information                                               */
      __IOM uint16_t WD_FAIL    : 2;            /*!< [3..2] Number of WD-Failure Events                                        */
      __IOM uint16_t SW_DEV     : 1;            /*!< [4..4] Status of Operating Mode                                           */
            uint16_t            : 1;
      __IOM uint16_t DEV_STAT   : 2;            /*!< [7..6] Device Status before Restart Mode                                  */
      __IOM uint16_t CRC_FAIL   : 1;            /*!< [8..8] CRC Fail Information1)                                             */
      __IM  uint16_t CRC_STAT   : 1;            /*!< [9..9] CRC STAT Information                                               */
            uint16_t            : 6;
    } bit;
  } DEV_STAT;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000082) Bus Communication Status                                   */
    
    struct {
      __IOM uint16_t VCAN_UV    : 1;            /*!< [0..0] Under Voltage CAN Bus Supply                                       */
      __IOM uint16_t CAN_FAIL   : 2;            /*!< [2..1] CAN failure status                                                 */
      __IOM uint16_t SYSERR     : 1;            /*!< [3..3] SWK System Error                                                   */
      __IOM uint16_t CANTO      : 1;            /*!< [4..4] CAN Time Out Detection                                             */
            uint16_t            : 11;
    } bit;
  } BUS_STAT;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000084) Wake-up Source and Information Status                      */
    
    struct {
            uint16_t            : 3;
      __IOM uint16_t WK4_WU     : 1;            /*!< [3..3] Wake up via WK4                                                    */
      __IOM uint16_t WK5_WU     : 1;            /*!< [4..4] Wake up via WK5                                                    */
            uint16_t            : 2;
      __IOM uint16_t TIMER1_WU  : 1;            /*!< [7..7] Wake up via Timer1                                                 */
      __IOM uint16_t TIMER2_WU  : 1;            /*!< [8..8] Wake up via Timer2                                                 */
      __IOM uint16_t CAN_WU     : 1;            /*!< [9..9] Wake up via CAN Bus                                                */
            uint16_t            : 6;
    } bit;
  } WK_STAT;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000086) WK Input Level                                             */
    
