jassony/infineon2b6/TLE9563_LLD/inc/TLE9563.h
    struct {
            uint16_t            : 3;
      __IM  uint16_t WK4_LVL    : 1;            /*!< [3..3] Status of WK4                                                      */
      __IM  uint16_t WK5_LVL    : 1;            /*!< [4..4] Status of WK5                                                      */
            uint16_t            : 11;
    } bit;
  } WK_LVL_STAT;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000088) High-Side Switch Status                                    */
    
    struct {
      __IOM uint16_t HS1_OC     : 1;            /*!< [0..0] Overcurrent Detection on HS1                                       */
      __IOM uint16_t HS2_OC     : 1;            /*!< [1..1] Overcurrent Detection on HS2                                       */
      __IOM uint16_t HS3_OC     : 1;            /*!< [2..2] Overcurrent Detection on HS3                                       */
            uint16_t            : 2;
      __IOM uint16_t HS1_OL     : 1;            /*!< [5..5] Open-Load Detection on HS1                                         */
      __IOM uint16_t HS2_OL     : 1;            /*!< [6..6] Open-Load Detection on HS2                                         */
      __IOM uint16_t HS3_OL     : 1;            /*!< [7..7] Open-Load Detection on HS3                                         */
            uint16_t            : 2;
      __IOM uint16_t HS1_OT     : 1;            /*!< [10..10] Overtemperature Detection on HS1                                 */
      __IOM uint16_t HS2_OT     : 1;            /*!< [11..11] Overtemperature Detection on HS2                                 */
      __IOM uint16_t HS3_OT     : 1;            /*!< [12..12] Overtemperature Detection on HS3                                 */
            uint16_t            : 3;
    } bit;
  } HS_OL_OC_OT_STAT;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000008A) General Status register                                    */
    
    struct {
      __IM  uint16_t PWM1STAT   : 1;            /*!< [0..0] PWM1/CRC status                                                    */
      __IM  uint16_t PWM2STAT   : 1;            /*!< [1..1] PWM2 Status                                                        */
      __IM  uint16_t PWM3STAT   : 1;            /*!< [2..2] PWM3 status                                                        */
      __IM  uint16_t PWM4STAT   : 1;            /*!< [3..3] PWM4 Status                                                        */
      __IM  uint16_t PWM5STAT   : 1;            /*!< [4..4] PWM5 status                                                        */
      __IM  uint16_t PWM6STAT   : 1;            /*!< [5..5] PWM6 status                                                        */
      __IM  uint16_t HB1VOUT    : 1;            /*!< [6..6] Voltage level at VSH1 when HB1MODE[10] = 11 and CPEN=1             */
      __IM  uint16_t HB2VOUT    : 1;            /*!< [7..7] Voltage level at VSH2 when HB2MODE[10] = 11 and CPEN=1             */
      __IM  uint16_t HB3VOUT    : 1;            /*!< [8..8] Voltage level at VSH3 when HB3MODE[10] = 11 and CPEN=1             */
            uint16_t            : 7;
    } bit;
  } GEN_STAT;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000008C) Turn-on/off delay regulation register                      */
    
    struct {
      __IM  uint16_t TDREG1     : 1;            /*!< [0..0] HB1 Regulation of turn-on/off delay                                */
      __IM  uint16_t TDREG2     : 1;            /*!< [1..1] HB2 Regulation of turn-on/off delay                                */
      __IM  uint16_t TDREG3     : 1;            /*!< [2..2] HB3 Regulation of turn-on/off delay                                */
            uint16_t            : 1;
      __IM  uint16_t IPCHG1_ST  : 1;            /*!< [4..4] HB1 precharge status                                               */
      __IM  uint16_t IPCHG2_ST  : 1;            /*!< [5..5] HB2 precharge status                                               */
      __IM  uint16_t IPCHG3_ST  : 1;            /*!< [6..6] HB3 precharge status                                               */
            uint16_t            : 1;
      __IM  uint16_t IPDCHG1_ST : 1;            /*!< [8..8] HB1 predischarge status                                            */
      __IM  uint16_t IPDCHG2_ST : 1;            /*!< [9..9] HB2 predischarge status                                            */
      __IM  uint16_t IPDCHG3_ST : 1;            /*!< [10..10] HB3 predischarge status                                          */
            uint16_t            : 5;
    } bit;
  } TDREG;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000008E) Drain-source overvoltage                                   */
    
    struct {
      __IOM uint16_t HS1DSOV    : 1;            /*!< [0..0] Drain-source overvoltage on high-side 1                            */
      __IOM uint16_t LS1DSOV    : 1;            /*!< [1..1] Drain-source overvoltage on low-side 1                             */
      __IOM uint16_t HS2DSOV    : 1;            /*!< [2..2] Drain-source overvoltage on high-side 2                            */
      __IOM uint16_t LS2DSOV    : 1;            /*!< [3..3] Drain-source overvoltage on low-side 2                             */
      __IOM uint16_t HS3DSOV    : 1;            /*!< [4..4] Drain-source overvoltage on high-side 3                            */
      __IOM uint16_t LS3DSOV    : 1;            /*!< [5..5] Drain-source overvoltage on low-side 3                             */
            uint16_t            : 2;
      __IOM uint16_t LS1DSOV_BRK : 1;           /*!< [8..8] Drain-source overvoltage on low-side 1 during braking              */
      __IOM uint16_t LS2DSOV_BRK : 1;           /*!< [9..9] Drain-source overvoltage on low-side 2 during braking              */
      __IOM uint16_t LS3DSOV_BRK : 1;           /*!< [10..10] Drain-source overvoltage on low-side 3 during braking            */
            uint16_t            : 1;
      __IOM uint16_t VSOVBRAKE_ST : 1;          /*!< [12..12] VS Brake status                                                  */
      __IOM uint16_t VSINTOVBRAKE_ST : 1;       /*!< [13..13] VSINT Brake status                                               */
      __IOM uint16_t OC_CSA     : 1;            /*!< [14..14] CSA Overcurrent detection                                        */
            uint16_t            : 1;
    } bit;
  } DSOV;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000090) Effective MOSFET turn.on/off delay - HB1                   */
    
