jassony/infineon2b6/TLE9563_LLD/inc/TLE9563.h
    struct {
      __IM  uint16_t TDON1EFF   : 6;            /*!< [5..0] Effective active MOSFET turn-on delay HB1 Nominal effective
                                                     tDON1 = 53.3 ns x TDON1EFF[50]D                                           */
            uint16_t            : 2;
      __IM  uint16_t TDOFF1EFF  : 6;            /*!< [13..8] Effective active MOSFET turn-off delay HB1                        */
            uint16_t            : 2;
    } bit;
  } EFF_TDON_OFF1;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000092) Effective MOSFET turn.on/off delay - HB 2                  */
    
    struct {
      __IM  uint16_t TDON2EFF   : 6;            /*!< [5..0] Effective active MOSFET turn-on delay HB2 Nominal effective
                                                     tDON2 = 53.3 ns x TDON2EFF[50]D                                           */
            uint16_t            : 2;
      __IM  uint16_t TDOFF2EFF  : 6;            /*!< [13..8] Effective active MOSFET turn-off delay HB2                        */
            uint16_t            : 2;
    } bit;
  } EFF_TDON_OFF2;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000094) Effective MOSFET turn.on/off delay - HB3                   */
    
    struct {
      __IM  uint16_t TDON3EFF   : 6;            /*!< [5..0] Effective active MOSFET turn-on delay HB3 Nominal effective
                                                     tDON3 = 53.3 ns x TDON3EFF[50]D                                           */
            uint16_t            : 2;
      __IM  uint16_t TDOFF3EFF  : 6;            /*!< [13..8] Effective active MOSFET turn-off delay HB3 Nominal effective
                                                     tDOFF3 = 53.3 ns x TDO3EFF[138]D                                          */
            uint16_t            : 2;
    } bit;
  } EFF_TDON_OFF3;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000096) MOSFET rise/fall time - HB1                                */
    
    struct {
      __IM  uint16_t TRISE1     : 6;            /*!< [5..0] Active MOSFET rise time HB1                                        */
            uint16_t            : 2;
      __IM  uint16_t TFALL1     : 6;            /*!< [13..8] Active MOSFET fall time HB1                                       */
            uint16_t            : 2;
    } bit;
  } TRISE_FALL1;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000098) MOSFET rise/fall time - HB2                                */
    
    struct {
      __IM  uint16_t TRISE2     : 6;            /*!< [5..0] Active MOSFET rise time HB2                                        */
            uint16_t            : 2;
      __IM  uint16_t TFALL2     : 6;            /*!< [13..8] Active MOSFET fall time HB2                                       */
            uint16_t            : 2;
    } bit;
  } TRISE_FALL2;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000009A) MOSFET rise/fall time - HB3                                */
    
    struct {
      __IM  uint16_t TRISE3     : 6;            /*!< [5..0] Active MOSFET rise time HB3                                        */
            uint16_t            : 2;
      __IM  uint16_t TFALL3     : 6;            /*!< [13..8] Active MOSFET fall time HB3                                       */
            uint16_t            : 2;
    } bit;
  } TRISE_FALL3;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000009C) Selective Wake Status                                      */
    
    struct {
            uint16_t            : 2;
      __IM  uint16_t SWK_SET    : 1;            /*!< [2..2] Selective Wake Activity                                            */
      __IM  uint16_t CANSIL     : 1;            /*!< [3..3] CAN Silent Time during SWK operation                               */
      __IOM uint16_t WUF        : 1;            /*!< [4..4] SWK Wake-up Frame Detection                                        */
      __IOM uint16_t WUP        : 1;            /*!< [5..5] Wake-up Pattern Detection                                          */
      __IM  uint16_t SYNC       : 1;            /*!< [6..6] Synchronisation (at least one CAN frame without fail
                                                     must have been received)                                                  */
            uint16_t            : 9;
    } bit;
  } SWK_STAT;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000009E) Selective Wake ECNT Status                                 */
    
    struct {
      __IM  uint16_t ECNT       : 6;            /*!< [5..0] SWK CAN Frame Error Counter                                        */
            uint16_t            : 10;
    } bit;
  } SWK_ECNT_STAT;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000A0) Selective Wake CDR Status                                  */
    
    struct {
            uint16_t            : 4;
      __IM  uint16_t N_AVG      : 12;           /*!< [15..4] Output Value from Filter Block                                    */
    } bit;
  } SWK_CDR_STAT;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000A2) Family and Product Identification Register                 */
    
    struct {
      __IM  uint16_t PROD       : 7;            /*!< [6..0] Device Product Identifier                                          */
      __IM  uint16_t FAM        : 4;            /*!< [10..7] Device Family Identifier                                          */
            uint16_t            : 5;
    } bit;
  } FAM_PROD_STAT;
}
TLE9563_Type;                                 /*!< Size = 164 (0xa4)                                                         */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


