jassony/infineon2b6/TLE9563_LLD/inc/TLE9563.h
/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define TLE9563_BASE                0x00000000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

extern TLE9563_Type* TLE9563;

/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================================================================================================== */
/* ================                                Pos/Mask Peripheral Section                                ================ */
/* =========================================================================================================================== */


/** @addtogroup PosMask_peripherals
  * @{
  */


/* =========================================================================================================================== */
/* ================                                          TLE9563                                          ================ */
/* =========================================================================================================================== */

/* =======================================================  M_S_CTRL  ======================================================== */
#define TLE9563_M_S_CTRL_MODE_Pos         (14UL)                    /*!< MODE (Bit 14)                                         */
#define TLE9563_M_S_CTRL_MODE_Msk         (0xc000UL)                /*!< MODE (Bitfield-Mask: 0x03)                            */
#define TLE9563_M_S_CTRL_VCC1_OV_MOD_Pos  (9UL)                     /*!< VCC1_OV_MOD (Bit 9)                                   */
#define TLE9563_M_S_CTRL_VCC1_OV_MOD_Msk  (0x600UL)                 /*!< VCC1_OV_MOD (Bitfield-Mask: 0x03)                     */
#define TLE9563_M_S_CTRL_RSTN_HYS_Pos     (7UL)                     /*!< RSTN_HYS (Bit 7)                                      */
#define TLE9563_M_S_CTRL_RSTN_HYS_Msk     (0x80UL)                  /*!< RSTN_HYS (Bitfield-Mask: 0x01)                        */
#define TLE9563_M_S_CTRL_I_PEAK_TH_Pos    (5UL)                     /*!< I_PEAK_TH (Bit 5)                                     */
#define TLE9563_M_S_CTRL_I_PEAK_TH_Msk    (0x20UL)                  /*!< I_PEAK_TH (Bitfield-Mask: 0x01)                       */
#define TLE9563_M_S_CTRL_VCC1_RT_Pos      (0UL)                     /*!< VCC1_RT (Bit 0)                                       */
#define TLE9563_M_S_CTRL_VCC1_RT_Msk      (0x3UL)                   /*!< VCC1_RT (Bitfield-Mask: 0x03)                         */
/* ========================================================  HW_CTRL  ======================================================== */
#define TLE9563_HW_CTRL_TSD2_DEL_Pos      (12UL)                    /*!< TSD2_DEL (Bit 12)                                     */
#define TLE9563_HW_CTRL_TSD2_DEL_Msk      (0x1000UL)                /*!< TSD2_DEL (Bitfield-Mask: 0x01)                        */
#define TLE9563_HW_CTRL_VS_OV_SEL_Pos     (11UL)                    /*!< VS_OV_SEL (Bit 11)                                    */
#define TLE9563_HW_CTRL_VS_OV_SEL_Msk     (0x800UL)                 /*!< VS_OV_SEL (Bitfield-Mask: 0x01)                       */
#define TLE9563_HW_CTRL_SH_DISABLE_Pos    (10UL)                    /*!< SH_DISABLE (Bit 10)                                   */
#define TLE9563_HW_CTRL_SH_DISABLE_Msk    (0x400UL)                 /*!< SH_DISABLE (Bitfield-Mask: 0x01)                      */
#define TLE9563_HW_CTRL_RSTN_DEL_Pos      (9UL)                     /*!< RSTN_DEL (Bit 9)                                      */
#define TLE9563_HW_CTRL_RSTN_DEL_Msk      (0x200UL)                 /*!< RSTN_DEL (Bitfield-Mask: 0x01)                        */
#define TLE9563_HW_CTRL_SOFT_RESET_RO_Pos (6UL)                     /*!< SOFT_RESET_RO (Bit 6)                                 */
#define TLE9563_HW_CTRL_SOFT_RESET_RO_Msk (0x40UL)                  /*!< SOFT_RESET_RO (Bitfield-Mask: 0x01)                   */
#define TLE9563_HW_CTRL_WD_STM_EN_1_Pos   (2UL)                     /*!< WD_STM_EN_1 (Bit 2)                                   */
#define TLE9563_HW_CTRL_WD_STM_EN_1_Msk   (0x4UL)                   /*!< WD_STM_EN_1 (Bitfield-Mask: 0x01)                     */
/* ========================================================  WD_CTRL  ======================================================== */
#define TLE9563_WD_CTRL_CHECKSUM_Pos      (15UL)                    /*!< CHECKSUM (Bit 15)                                     */
#define TLE9563_WD_CTRL_CHECKSUM_Msk      (0x8000UL)                /*!< CHECKSUM (Bitfield-Mask: 0x01)                        */
#define TLE9563_WD_CTRL_WD_STM_EN_0_Pos   (6UL)                     /*!< WD_STM_EN_0 (Bit 6)                                   */
#define TLE9563_WD_CTRL_WD_STM_EN_0_Msk   (0x40UL)                  /*!< WD_STM_EN_0 (Bitfield-Mask: 0x01)                     */
#define TLE9563_WD_CTRL_WD_CFG_Pos        (5UL)                     /*!< WD_CFG (Bit 5)                                        */
#define TLE9563_WD_CTRL_WD_CFG_Msk        (0x20UL)                  /*!< WD_CFG (Bitfield-Mask: 0x01)                          */
#define TLE9563_WD_CTRL_WD_EN_WK_BUS_Pos  (4UL)                     /*!< WD_EN_WK_BUS (Bit 4)                                  */
#define TLE9563_WD_CTRL_WD_EN_WK_BUS_Msk  (0x10UL)                  /*!< WD_EN_WK_BUS (Bitfield-Mask: 0x01)                    */
#define TLE9563_WD_CTRL_WD_TIMER_Pos      (0UL)                     /*!< WD_TIMER (Bit 0)                                      */
#define TLE9563_WD_CTRL_WD_TIMER_Msk      (0x7UL)                   /*!< WD_TIMER (Bitfield-Mask: 0x07)                        */
/* =======================================================  BUS_CTRL  ======================================================== */
#define TLE9563_BUS_CTRL_CAN_Pos          (0UL)                     /*!< CAN (Bit 0)                                           */
#define TLE9563_BUS_CTRL_CAN_Msk          (0x7UL)                   /*!< CAN (Bitfield-Mask: 0x07)                             */
/* =====================================================  WK_CTRL_BNK3  ====================================================== */
#define TLE9563_WK_CTRL_BNK3_WK_FILT_Pos  (11UL)                    /*!< WK_FILT (Bit 11)                                      */
#define TLE9563_WK_CTRL_BNK3_WK_FILT_Msk  (0x3800UL)                /*!< WK_FILT (Bitfield-Mask: 0x07)                         */
#define TLE9563_WK_CTRL_BNK3_WK_PUPD_Pos  (9UL)                     /*!< WK_PUPD (Bit 9)                                       */
#define TLE9563_WK_CTRL_BNK3_WK_PUPD_Msk  (0x600UL)                 /*!< WK_PUPD (Bitfield-Mask: 0x03)                         */
#define TLE9563_WK_CTRL_BNK3_WK_EN_Pos    (5UL)                     /*!< WK_EN (Bit 5)                                         */
#define TLE9563_WK_CTRL_BNK3_WK_EN_Msk    (0x60UL)                  /*!< WK_EN (Bitfield-Mask: 0x03)                           */
#define TLE9563_WK_CTRL_BNK3_WK_BNK_Pos   (0UL)                     /*!< WK_BNK (Bit 0)                                        */
#define TLE9563_WK_CTRL_BNK3_WK_BNK_Msk   (0x7UL)                   /*!< WK_BNK (Bitfield-Mask: 0x07)                          */
/* =====================================================  WK_CTRL_BNK4  ====================================================== */
#define TLE9563_WK_CTRL_BNK4_WK_FILT_Pos  (11UL)                    /*!< WK_FILT (Bit 11)                                      */
#define TLE9563_WK_CTRL_BNK4_WK_FILT_Msk  (0x3800UL)                /*!< WK_FILT (Bitfield-Mask: 0x07)                         */
#define TLE9563_WK_CTRL_BNK4_WK_PUPD_Pos  (9UL)                     /*!< WK_PUPD (Bit 9)                                       */
#define TLE9563_WK_CTRL_BNK4_WK_PUPD_Msk  (0x600UL)                 /*!< WK_PUPD (Bitfield-Mask: 0x03)                         */
#define TLE9563_WK_CTRL_BNK4_WK_EN_Pos    (5UL)                     /*!< WK_EN (Bit 5)                                         */
#define TLE9563_WK_CTRL_BNK4_WK_EN_Msk    (0x60UL)                  /*!< WK_EN (Bitfield-Mask: 0x03)                           */
#define TLE9563_WK_CTRL_BNK4_WK_BNK_Pos   (0UL)                     /*!< WK_BNK (Bit 0)                                        */
#define TLE9563_WK_CTRL_BNK4_WK_BNK_Msk   (0x7UL)                   /*!< WK_BNK (Bitfield-Mask: 0x07)                          */
/* ======================================================  TIMER_CTRL  ======================================================= */
#define TLE9563_TIMER_CTRL_TIMER2_ON_Pos  (13UL)                    /*!< TIMER2_ON (Bit 13)                                    */
#define TLE9563_TIMER_CTRL_TIMER2_ON_Msk  (0xe000UL)                /*!< TIMER2_ON (Bitfield-Mask: 0x07)                       */
#define TLE9563_TIMER_CTRL_TIMER2_PER_Pos (9UL)                     /*!< TIMER2_PER (Bit 9)                                    */
#define TLE9563_TIMER_CTRL_TIMER2_PER_Msk (0xe00UL)                 /*!< TIMER2_PER (Bitfield-Mask: 0x07)                      */
#define TLE9563_TIMER_CTRL_CYCWK_Pos      (7UL)                     /*!< CYCWK (Bit 7)                                         */
#define TLE9563_TIMER_CTRL_CYCWK_Msk      (0x180UL)                 /*!< CYCWK (Bitfield-Mask: 0x03)                           */
#define TLE9563_TIMER_CTRL_TIMER1_ON_Pos  (4UL)                     /*!< TIMER1_ON (Bit 4)                                     */
#define TLE9563_TIMER_CTRL_TIMER1_ON_Msk  (0x70UL)                  /*!< TIMER1_ON (Bitfield-Mask: 0x07)                       */
#define TLE9563_TIMER_CTRL_TIMER1_PER_Pos (0UL)                     /*!< TIMER1_PER (Bit 0)                                    */
#define TLE9563_TIMER_CTRL_TIMER1_PER_Msk (0x7UL)                   /*!< TIMER1_PER (Bitfield-Mask: 0x07)                      */
/* ======================================================  SW_SD_CTRL  ======================================================= */
#define TLE9563_SW_SD_CTRL_HS3_OV_REC_Pos (14UL)                    /*!< HS3_OV_REC (Bit 14)                                   */
#define TLE9563_SW_SD_CTRL_HS3_OV_REC_Msk (0x4000UL)                /*!< HS3_OV_REC (Bitfield-Mask: 0x01)                      */
#define TLE9563_SW_SD_CTRL_HS2_OV_REC_Pos (13UL)                    /*!< HS2_OV_REC (Bit 13)                                   */
#define TLE9563_SW_SD_CTRL_HS2_OV_REC_Msk (0x2000UL)                /*!< HS2_OV_REC (Bitfield-Mask: 0x01)                      */
#define TLE9563_SW_SD_CTRL_HS1_OV_REC_Pos (12UL)                    /*!< HS1_OV_REC (Bit 12)                                   */
#define TLE9563_SW_SD_CTRL_HS1_OV_REC_Msk (0x1000UL)                /*!< HS1_OV_REC (Bitfield-Mask: 0x01)                      */
#define TLE9563_SW_SD_CTRL_HS_OT_SD_DIS_Pos (11UL)                  /*!< HS_OT_SD_DIS (Bit 11)                                 */
#define TLE9563_SW_SD_CTRL_HS_OT_SD_DIS_Msk (0x800UL)               /*!< HS_OT_SD_DIS (Bitfield-Mask: 0x01)                    */
#define TLE9563_SW_SD_CTRL_HS3_OV_SDN_DIS_Pos (9UL)                 /*!< HS3_OV_SDN_DIS (Bit 9)                                */
#define TLE9563_SW_SD_CTRL_HS3_OV_SDN_DIS_Msk (0x200UL)             /*!< HS3_OV_SDN_DIS (Bitfield-Mask: 0x01)                  */
#define TLE9563_SW_SD_CTRL_HS2_OV_SDN_DIS_Pos (8UL)                 /*!< HS2_OV_SDN_DIS (Bit 8)                                */
#define TLE9563_SW_SD_CTRL_HS2_OV_SDN_DIS_Msk (0x100UL)             /*!< HS2_OV_SDN_DIS (Bitfield-Mask: 0x01)                  */
#define TLE9563_SW_SD_CTRL_HS1_OV_SDN_DIS_Pos (7UL)                 /*!< HS1_OV_SDN_DIS (Bit 7)                                */
#define TLE9563_SW_SD_CTRL_HS1_OV_SDN_DIS_Msk (0x80UL)              /*!< HS1_OV_SDN_DIS (Bitfield-Mask: 0x01)                  */
#define TLE9563_SW_SD_CTRL_HS_OV_SDS_DIS_Pos (6UL)                  /*!< HS_OV_SDS_DIS (Bit 6)                                 */
#define TLE9563_SW_SD_CTRL_HS_OV_SDS_DIS_Msk (0x40UL)               /*!< HS_OV_SDS_DIS (Bitfield-Mask: 0x01)                   */
#define TLE9563_SW_SD_CTRL_HS_UV_SD_DIS_Pos (5UL)                   /*!< HS_UV_SD_DIS (Bit 5)                                  */
#define TLE9563_SW_SD_CTRL_HS_UV_SD_DIS_Msk (0x20UL)                /*!< HS_UV_SD_DIS (Bitfield-Mask: 0x01)                    */
#define TLE9563_SW_SD_CTRL_HS_UV_REC_Pos  (3UL)                     /*!< HS_UV_REC (Bit 3)                                     */
#define TLE9563_SW_SD_CTRL_HS_UV_REC_Msk  (0x8UL)                   /*!< HS_UV_REC (Bitfield-Mask: 0x01)                       */
/* ========================================================  HS_CTRL  ======================================================== */
#define TLE9563_HS_CTRL_HS3_Pos           (8UL)                     /*!< HS3 (Bit 8)                                           */
#define TLE9563_HS_CTRL_HS3_Msk           (0xf00UL)                 /*!< HS3 (Bitfield-Mask: 0x0f)                             */
#define TLE9563_HS_CTRL_HS2_Pos           (4UL)                     /*!< HS2 (Bit 4)                                           */
#define TLE9563_HS_CTRL_HS2_Msk           (0xf0UL)                  /*!< HS2 (Bitfield-Mask: 0x0f)                             */
#define TLE9563_HS_CTRL_HS1_Pos           (0UL)                     /*!< HS1 (Bit 0)                                           */
#define TLE9563_HS_CTRL_HS1_Msk           (0xfUL)                   /*!< HS1 (Bitfield-Mask: 0x0f)                             */
/* =======================================================  INT_MASK  ======================================================== */
#define TLE9563_INT_MASK_INTN_CYC_EN_Pos  (8UL)                     /*!< INTN_CYC_EN (Bit 8)                                   */
#define TLE9563_INT_MASK_INTN_CYC_EN_Msk  (0x100UL)                 /*!< INTN_CYC_EN (Bitfield-Mask: 0x01)                     */
#define TLE9563_INT_MASK_WD_SDM_DISABLE_Pos (7UL)                   /*!< WD_SDM_DISABLE (Bit 7)                                */
#define TLE9563_INT_MASK_WD_SDM_DISABLE_Msk (0x80UL)                /*!< WD_SDM_DISABLE (Bitfield-Mask: 0x01)                  */
#define TLE9563_INT_MASK_WD_SDM_Pos       (6UL)                     /*!< WD_SDM (Bit 6)                                        */
#define TLE9563_INT_MASK_WD_SDM_Msk       (0x40UL)                  /*!< WD_SDM (Bitfield-Mask: 0x01)                          */
#define TLE9563_INT_MASK_SPI_CRC_FAIL_Pos (5UL)                     /*!< SPI_CRC_FAIL (Bit 5)                                  */
#define TLE9563_INT_MASK_SPI_CRC_FAIL_Msk (0x20UL)                  /*!< SPI_CRC_FAIL (Bitfield-Mask: 0x01)                    */
#define TLE9563_INT_MASK_BD_STAT_Pos      (4UL)                     /*!< BD_STAT (Bit 4)                                       */
#define TLE9563_INT_MASK_BD_STAT_Msk      (0x10UL)                  /*!< BD_STAT (Bitfield-Mask: 0x01)                         */
#define TLE9563_INT_MASK_HS_STAT_Pos      (3UL)                     /*!< HS_STAT (Bit 3)                                       */
#define TLE9563_INT_MASK_HS_STAT_Msk      (0x8UL)                   /*!< HS_STAT (Bitfield-Mask: 0x01)                         */
#define TLE9563_INT_MASK_BUS_STAT_Pos     (2UL)                     /*!< BUS_STAT (Bit 2)                                      */
#define TLE9563_INT_MASK_BUS_STAT_Msk     (0x4UL)                   /*!< BUS_STAT (Bitfield-Mask: 0x01)                        */
#define TLE9563_INT_MASK_TEMP_STAT_Pos    (1UL)                     /*!< TEMP_STAT (Bit 1)                                     */
#define TLE9563_INT_MASK_TEMP_STAT_Msk    (0x2UL)                   /*!< TEMP_STAT (Bitfield-Mask: 0x01)                       */
#define TLE9563_INT_MASK_SUPPLY_STAT_Pos  (0UL)                     /*!< SUPPLY_STAT (Bit 0)                                   */
#define TLE9563_INT_MASK_SUPPLY_STAT_Msk  (0x1UL)                   /*!< SUPPLY_STAT (Bitfield-Mask: 0x01)                     */
/* =====================================================  PWM_CTRL_BNK0  ===================================================== */
#define TLE9563_PWM_CTRL_BNK0_PWM_FREQ_Pos (14UL)                   /*!< PWM_FREQ (Bit 14)                                     */
#define TLE9563_PWM_CTRL_BNK0_PWM_FREQ_Msk (0x4000UL)               /*!< PWM_FREQ (Bitfield-Mask: 0x01)                        */
#define TLE9563_PWM_CTRL_BNK0_PWM_DC_Pos  (4UL)                     /*!< PWM_DC (Bit 4)                                        */
#define TLE9563_PWM_CTRL_BNK0_PWM_DC_Msk  (0x3ff0UL)                /*!< PWM_DC (Bitfield-Mask: 0x3ff)                         */
#define TLE9563_PWM_CTRL_BNK0_PWM_BNK_Pos (0UL)                     /*!< PWM_BNK (Bit 0)                                       */
#define TLE9563_PWM_CTRL_BNK0_PWM_BNK_Msk (0x7UL)                   /*!< PWM_BNK (Bitfield-Mask: 0x07)                         */
/* =====================================================  PWM_CTRL_BNK1  ===================================================== */
#define TLE9563_PWM_CTRL_BNK1_PWM_FREQ_Pos (14UL)                   /*!< PWM_FREQ (Bit 14)                                     */
#define TLE9563_PWM_CTRL_BNK1_PWM_FREQ_Msk (0x4000UL)               /*!< PWM_FREQ (Bitfield-Mask: 0x01)                        */
#define TLE9563_PWM_CTRL_BNK1_PWM_DC_Pos  (4UL)                     /*!< PWM_DC (Bit 4)                                        */
#define TLE9563_PWM_CTRL_BNK1_PWM_DC_Msk  (0x3ff0UL)                /*!< PWM_DC (Bitfield-Mask: 0x3ff)                         */
#define TLE9563_PWM_CTRL_BNK1_PWM_BNK_Pos (0UL)                     /*!< PWM_BNK (Bit 0)                                       */
#define TLE9563_PWM_CTRL_BNK1_PWM_BNK_Msk (0x7UL)                   /*!< PWM_BNK (Bitfield-Mask: 0x07)                         */
/* =====================================================  PWM_CTRL_BNK2  ===================================================== */
#define TLE9563_PWM_CTRL_BNK2_PWM_FREQ_Pos (14UL)                   /*!< PWM_FREQ (Bit 14)                                     */
#define TLE9563_PWM_CTRL_BNK2_PWM_FREQ_Msk (0x4000UL)               /*!< PWM_FREQ (Bitfield-Mask: 0x01)                        */
#define TLE9563_PWM_CTRL_BNK2_PWM_DC_Pos  (4UL)                     /*!< PWM_DC (Bit 4)                                        */
#define TLE9563_PWM_CTRL_BNK2_PWM_DC_Msk  (0x3ff0UL)                /*!< PWM_DC (Bitfield-Mask: 0x3ff)                         */
#define TLE9563_PWM_CTRL_BNK2_PWM_BNK_Pos (0UL)                     /*!< PWM_BNK (Bit 0)                                       */
#define TLE9563_PWM_CTRL_BNK2_PWM_BNK_Msk (0x7UL)                   /*!< PWM_BNK (Bitfield-Mask: 0x07)                         */
/* =====================================================  PWM_CTRL_BNK3  ===================================================== */
#define TLE9563_PWM_CTRL_BNK3_PWM_FREQ_Pos (14UL)                   /*!< PWM_FREQ (Bit 14)                                     */
#define TLE9563_PWM_CTRL_BNK3_PWM_FREQ_Msk (0x4000UL)               /*!< PWM_FREQ (Bitfield-Mask: 0x01)                        */
#define TLE9563_PWM_CTRL_BNK3_PWM_DC_Pos  (4UL)                     /*!< PWM_DC (Bit 4)                                        */
#define TLE9563_PWM_CTRL_BNK3_PWM_DC_Msk  (0x3ff0UL)                /*!< PWM_DC (Bitfield-Mask: 0x3ff)                         */
#define TLE9563_PWM_CTRL_BNK3_PWM_BNK_Pos (0UL)                     /*!< PWM_BNK (Bit 0)                                       */
#define TLE9563_PWM_CTRL_BNK3_PWM_BNK_Msk (0x7UL)                   /*!< PWM_BNK (Bitfield-Mask: 0x07)                         */
/* =====================================================  SYS_STAT_CTRL  ===================================================== */
#define TLE9563_SYS_STAT_CTRL_SYS_STAT_Pos (0UL)                    /*!< SYS_STAT (Bit 0)                                      */
#define TLE9563_SYS_STAT_CTRL_SYS_STAT_Msk (0xffffUL)               /*!< SYS_STAT (Bitfield-Mask: 0xffff)                      */
/* ========================================================  GENCTRL  ======================================================== */
#define TLE9563_GENCTRL_BDFREQ_Pos        (15UL)                    /*!< BDFREQ (Bit 15)                                       */
#define TLE9563_GENCTRL_BDFREQ_Msk        (0x8000UL)                /*!< BDFREQ (Bitfield-Mask: 0x01)                          */
#define TLE9563_GENCTRL_CPUVTH_Pos        (12UL)                    /*!< CPUVTH (Bit 12)                                       */
#define TLE9563_GENCTRL_CPUVTH_Msk        (0x1000UL)                /*!< CPUVTH (Bitfield-Mask: 0x01)                          */
#define TLE9563_GENCTRL_FET_LVL_Pos       (11UL)                    /*!< FET_LVL (Bit 11)                                      */
#define TLE9563_GENCTRL_FET_LVL_Msk       (0x800UL)                 /*!< FET_LVL (Bitfield-Mask: 0x01)                         */
#define TLE9563_GENCTRL_CPSTGA_Pos        (10UL)                    /*!< CPSTGA (Bit 10)                                       */
#define TLE9563_GENCTRL_CPSTGA_Msk        (0x400UL)                 /*!< CPSTGA (Bitfield-Mask: 0x01)                          */
#define TLE9563_GENCTRL_BDOV_REC_Pos      (9UL)                     /*!< BDOV_REC (Bit 9)                                      */
#define TLE9563_GENCTRL_BDOV_REC_Msk      (0x200UL)                 /*!< BDOV_REC (Bitfield-Mask: 0x01)                        */
#define TLE9563_GENCTRL_IPCHGADT_Pos      (8UL)                     /*!< IPCHGADT (Bit 8)                                      */
#define TLE9563_GENCTRL_IPCHGADT_Msk      (0x100UL)                 /*!< IPCHGADT (Bitfield-Mask: 0x01)                        */
#define TLE9563_GENCTRL_AGC_Pos           (6UL)                     /*!< AGC (Bit 6)                                           */
#define TLE9563_GENCTRL_AGC_Msk           (0xc0UL)                  /*!< AGC (Bitfield-Mask: 0x03)                             */
#define TLE9563_GENCTRL_CPEN_Pos          (5UL)                     /*!< CPEN (Bit 5)                                          */
#define TLE9563_GENCTRL_CPEN_Msk          (0x20UL)                  /*!< CPEN (Bitfield-Mask: 0x01)                            */
#define TLE9563_GENCTRL_POCHGDIS_Pos      (4UL)                     /*!< POCHGDIS (Bit 4)                                      */
#define TLE9563_GENCTRL_POCHGDIS_Msk      (0x10UL)                  /*!< POCHGDIS (Bitfield-Mask: 0x01)                        */
#define TLE9563_GENCTRL_AGCFILT_Pos       (3UL)                     /*!< AGCFILT (Bit 3)                                       */
#define TLE9563_GENCTRL_AGCFILT_Msk       (0x8UL)                   /*!< AGCFILT (Bitfield-Mask: 0x01)                         */
#define TLE9563_GENCTRL_EN_GEN_CHECK_Pos  (2UL)                     /*!< EN_GEN_CHECK (Bit 2)                                  */
#define TLE9563_GENCTRL_EN_GEN_CHECK_Msk  (0x4UL)                   /*!< EN_GEN_CHECK (Bitfield-Mask: 0x01)                    */
#define TLE9563_GENCTRL_IHOLD_Pos         (1UL)                     /*!< IHOLD (Bit 1)                                         */
#define TLE9563_GENCTRL_IHOLD_Msk         (0x2UL)                   /*!< IHOLD (Bitfield-Mask: 0x01)                           */
#define TLE9563_GENCTRL_FMODE_Pos         (0UL)                     /*!< FMODE (Bit 0)                                         */
