jassony/infineon2b6/TLE9563_LLD/inc/TLE9563.h
#define TLE9563_GENCTRL_FMODE_Msk         (0x1UL)                   /*!< FMODE (Bitfield-Mask: 0x01)                           */
/* ==========================================================  CSA  ========================================================== */
#define TLE9563_CSA_PWM_NB_Pos            (10UL)                    /*!< PWM_NB (Bit 10)                                       */
#define TLE9563_CSA_PWM_NB_Msk            (0x400UL)                 /*!< PWM_NB (Bitfield-Mask: 0x01)                          */
#define TLE9563_CSA_CSO_CAP_Pos           (9UL)                     /*!< CSO_CAP (Bit 9)                                       */
#define TLE9563_CSA_CSO_CAP_Msk           (0x200UL)                 /*!< CSO_CAP (Bitfield-Mask: 0x01)                         */
#define TLE9563_CSA_CSD_Pos               (8UL)                     /*!< CSD (Bit 8)                                           */
#define TLE9563_CSA_CSD_Msk               (0x100UL)                 /*!< CSD (Bitfield-Mask: 0x01)                             */
#define TLE9563_CSA_OCFILT_Pos            (6UL)                     /*!< OCFILT (Bit 6)                                        */
#define TLE9563_CSA_OCFILT_Msk            (0xc0UL)                  /*!< OCFILT (Bitfield-Mask: 0x03)                          */
#define TLE9563_CSA_CSA_OFF_Pos           (5UL)                     /*!< CSA_OFF (Bit 5)                                       */
#define TLE9563_CSA_CSA_OFF_Msk           (0x20UL)                  /*!< CSA_OFF (Bitfield-Mask: 0x01)                         */
#define TLE9563_CSA_OCTH_Pos              (3UL)                     /*!< OCTH (Bit 3)                                          */
#define TLE9563_CSA_OCTH_Msk              (0x18UL)                  /*!< OCTH (Bitfield-Mask: 0x03)                            */
#define TLE9563_CSA_CSAG_Pos              (1UL)                     /*!< CSAG (Bit 1)                                          */
#define TLE9563_CSA_CSAG_Msk              (0x6UL)                   /*!< CSAG (Bitfield-Mask: 0x03)                            */
#define TLE9563_CSA_OCEN_Pos              (0UL)                     /*!< OCEN (Bit 0)                                          */
#define TLE9563_CSA_OCEN_Msk              (0x1UL)                   /*!< OCEN (Bitfield-Mask: 0x01)                            */
/* ========================================================  LS_VDS  ========================================================= */
#define TLE9563_LS_VDS_TFVDS_Pos          (12UL)                    /*!< TFVDS (Bit 12)                                        */
#define TLE9563_LS_VDS_TFVDS_Msk          (0x3000UL)                /*!< TFVDS (Bitfield-Mask: 0x03)                           */
#define TLE9563_LS_VDS_LS3VDSTH_Pos       (6UL)                     /*!< LS3VDSTH (Bit 6)                                      */
#define TLE9563_LS_VDS_LS3VDSTH_Msk       (0x1c0UL)                 /*!< LS3VDSTH (Bitfield-Mask: 0x07)                        */
#define TLE9563_LS_VDS_LS2VDSTH_Pos       (3UL)                     /*!< LS2VDSTH (Bit 3)                                      */
#define TLE9563_LS_VDS_LS2VDSTH_Msk       (0x38UL)                  /*!< LS2VDSTH (Bitfield-Mask: 0x07)                        */
#define TLE9563_LS_VDS_LS1VDSTH_Pos       (0UL)                     /*!< LS1VDSTH (Bit 0)                                      */
#define TLE9563_LS_VDS_LS1VDSTH_Msk       (0x7UL)                   /*!< LS1VDSTH (Bitfield-Mask: 0x07)                        */
/* ========================================================  HS_VDS  ========================================================= */
#define TLE9563_HS_VDS_DEEP_ADAP_Pos      (12UL)                    /*!< DEEP_ADAP (Bit 12)                                    */
#define TLE9563_HS_VDS_DEEP_ADAP_Msk      (0x1000UL)                /*!< DEEP_ADAP (Bitfield-Mask: 0x01)                       */
#define TLE9563_HS_VDS_HS3VDSTH_Pos       (6UL)                     /*!< HS3VDSTH (Bit 6)                                      */
#define TLE9563_HS_VDS_HS3VDSTH_Msk       (0x1c0UL)                 /*!< HS3VDSTH (Bitfield-Mask: 0x07)                        */
#define TLE9563_HS_VDS_HS2VDSTH_Pos       (3UL)                     /*!< HS2VDSTH (Bit 3)                                      */
#define TLE9563_HS_VDS_HS2VDSTH_Msk       (0x38UL)                  /*!< HS2VDSTH (Bitfield-Mask: 0x07)                        */
#define TLE9563_HS_VDS_HS1VDSTH_Pos       (0UL)                     /*!< HS1VDSTH (Bit 0)                                      */
#define TLE9563_HS_VDS_HS1VDSTH_Msk       (0x7UL)                   /*!< HS1VDSTH (Bitfield-Mask: 0x07)                        */
/* =====================================================  CCP_BLK_BNK0  ====================================================== */
#define TLE9563_CCP_BLK_BNK0_TBLANK_Pos   (12UL)                    /*!< TBLANK (Bit 12)                                       */
#define TLE9563_CCP_BLK_BNK0_TBLANK_Msk   (0xf000UL)                /*!< TBLANK (Bitfield-Mask: 0x0f)                          */
#define TLE9563_CCP_BLK_BNK0_TCCP_Pos     (8UL)                     /*!< TCCP (Bit 8)                                          */
#define TLE9563_CCP_BLK_BNK0_TCCP_Msk     (0xf00UL)                 /*!< TCCP (Bitfield-Mask: 0x0f)                            */
#define TLE9563_CCP_BLK_BNK0_CCP_BNK_Pos  (0UL)                     /*!< CCP_BNK (Bit 0)                                       */
#define TLE9563_CCP_BLK_BNK0_CCP_BNK_Msk  (0x7UL)                   /*!< CCP_BNK (Bitfield-Mask: 0x07)                         */
/* =====================================================  CCP_BLK_BNK1  ====================================================== */
#define TLE9563_CCP_BLK_BNK1_TBLANK_Pos   (12UL)                    /*!< TBLANK (Bit 12)                                       */
#define TLE9563_CCP_BLK_BNK1_TBLANK_Msk   (0xf000UL)                /*!< TBLANK (Bitfield-Mask: 0x0f)                          */
#define TLE9563_CCP_BLK_BNK1_TCCP_Pos     (8UL)                     /*!< TCCP (Bit 8)                                          */
#define TLE9563_CCP_BLK_BNK1_TCCP_Msk     (0xf00UL)                 /*!< TCCP (Bitfield-Mask: 0x0f)                            */
#define TLE9563_CCP_BLK_BNK1_CCP_BNK_Pos  (0UL)                     /*!< CCP_BNK (Bit 0)                                       */
#define TLE9563_CCP_BLK_BNK1_CCP_BNK_Msk  (0x7UL)                   /*!< CCP_BNK (Bitfield-Mask: 0x07)                         */
/* =====================================================  CCP_BLK_BNK2  ====================================================== */
#define TLE9563_CCP_BLK_BNK2_TBLANK_Pos   (12UL)                    /*!< TBLANK (Bit 12)                                       */
#define TLE9563_CCP_BLK_BNK2_TBLANK_Msk   (0xf000UL)                /*!< TBLANK (Bitfield-Mask: 0x0f)                          */
#define TLE9563_CCP_BLK_BNK2_TCCP_Pos     (8UL)                     /*!< TCCP (Bit 8)                                          */
#define TLE9563_CCP_BLK_BNK2_TCCP_Msk     (0xf00UL)                 /*!< TCCP (Bitfield-Mask: 0x0f)                            */
#define TLE9563_CCP_BLK_BNK2_CCP_BNK_Pos  (0UL)                     /*!< CCP_BNK (Bit 0)                                       */
#define TLE9563_CCP_BLK_BNK2_CCP_BNK_Msk  (0x7UL)                   /*!< CCP_BNK (Bitfield-Mask: 0x07)                         */
/* =====================================================  CCP_BLK_BNK4  ====================================================== */
#define TLE9563_CCP_BLK_BNK4_TBLANK_Pos   (12UL)                    /*!< TBLANK (Bit 12)                                       */
#define TLE9563_CCP_BLK_BNK4_TBLANK_Msk   (0xf000UL)                /*!< TBLANK (Bitfield-Mask: 0x0f)                          */
#define TLE9563_CCP_BLK_BNK4_TCCP_Pos     (8UL)                     /*!< TCCP (Bit 8)                                          */
#define TLE9563_CCP_BLK_BNK4_TCCP_Msk     (0xf00UL)                 /*!< TCCP (Bitfield-Mask: 0x0f)                            */
#define TLE9563_CCP_BLK_BNK4_CCP_BNK_Pos  (0UL)                     /*!< CCP_BNK (Bit 0)                                       */
#define TLE9563_CCP_BLK_BNK4_CCP_BNK_Msk  (0x7UL)                   /*!< CCP_BNK (Bitfield-Mask: 0x07)                         */
/* =====================================================  CCP_BLK_BNK5  ====================================================== */
#define TLE9563_CCP_BLK_BNK5_TBLANK_Pos   (12UL)                    /*!< TBLANK (Bit 12)                                       */
#define TLE9563_CCP_BLK_BNK5_TBLANK_Msk   (0xf000UL)                /*!< TBLANK (Bitfield-Mask: 0x0f)                          */
#define TLE9563_CCP_BLK_BNK5_TCCP_Pos     (8UL)                     /*!< TCCP (Bit 8)                                          */
#define TLE9563_CCP_BLK_BNK5_TCCP_Msk     (0xf00UL)                 /*!< TCCP (Bitfield-Mask: 0x0f)                            */
#define TLE9563_CCP_BLK_BNK5_CCP_BNK_Pos  (0UL)                     /*!< CCP_BNK (Bit 0)                                       */
#define TLE9563_CCP_BLK_BNK5_CCP_BNK_Msk  (0x7UL)                   /*!< CCP_BNK (Bitfield-Mask: 0x07)                         */
/* =====================================================  CCP_BLK_BNK6  ====================================================== */
#define TLE9563_CCP_BLK_BNK6_TBLANK_Pos   (12UL)                    /*!< TBLANK (Bit 12)                                       */
#define TLE9563_CCP_BLK_BNK6_TBLANK_Msk   (0xf000UL)                /*!< TBLANK (Bitfield-Mask: 0x0f)                          */
#define TLE9563_CCP_BLK_BNK6_TCCP_Pos     (8UL)                     /*!< TCCP (Bit 8)                                          */
#define TLE9563_CCP_BLK_BNK6_TCCP_Msk     (0xf00UL)                 /*!< TCCP (Bitfield-Mask: 0x0f)                            */
#define TLE9563_CCP_BLK_BNK6_CCP_BNK_Pos  (0UL)                     /*!< CCP_BNK (Bit 0)                                       */
#define TLE9563_CCP_BLK_BNK6_CCP_BNK_Msk  (0x7UL)                   /*!< CCP_BNK (Bitfield-Mask: 0x07)                         */
/* ========================================================  HBMODE  ========================================================= */
#define TLE9563_HBMODE_HB3MODE_Pos        (10UL)                    /*!< HB3MODE (Bit 10)                                      */
#define TLE9563_HBMODE_HB3MODE_Msk        (0xc00UL)                 /*!< HB3MODE (Bitfield-Mask: 0x03)                         */
#define TLE9563_HBMODE_AFW3_Pos           (9UL)                     /*!< AFW3 (Bit 9)                                          */
#define TLE9563_HBMODE_AFW3_Msk           (0x200UL)                 /*!< AFW3 (Bitfield-Mask: 0x01)                            */
#define TLE9563_HBMODE_HB3_PWM_EN_Pos     (8UL)                     /*!< HB3_PWM_EN (Bit 8)                                    */
#define TLE9563_HBMODE_HB3_PWM_EN_Msk     (0x100UL)                 /*!< HB3_PWM_EN (Bitfield-Mask: 0x01)                      */
#define TLE9563_HBMODE_HB2MODE_Pos        (6UL)                     /*!< HB2MODE (Bit 6)                                       */
#define TLE9563_HBMODE_HB2MODE_Msk        (0xc0UL)                  /*!< HB2MODE (Bitfield-Mask: 0x03)                         */
#define TLE9563_HBMODE_AFW2_Pos           (5UL)                     /*!< AFW2 (Bit 5)                                          */
#define TLE9563_HBMODE_AFW2_Msk           (0x20UL)                  /*!< AFW2 (Bitfield-Mask: 0x01)                            */
#define TLE9563_HBMODE_HB2_PWM_EN_Pos     (4UL)                     /*!< HB2_PWM_EN (Bit 4)                                    */
#define TLE9563_HBMODE_HB2_PWM_EN_Msk     (0x10UL)                  /*!< HB2_PWM_EN (Bitfield-Mask: 0x01)                      */
#define TLE9563_HBMODE_HB1MODE_Pos        (2UL)                     /*!< HB1MODE (Bit 2)                                       */
#define TLE9563_HBMODE_HB1MODE_Msk        (0xcUL)                   /*!< HB1MODE (Bitfield-Mask: 0x03)                         */
#define TLE9563_HBMODE_AFW1_Pos           (1UL)                     /*!< AFW1 (Bit 1)                                          */
#define TLE9563_HBMODE_AFW1_Msk           (0x2UL)                   /*!< AFW1 (Bitfield-Mask: 0x01)                            */
#define TLE9563_HBMODE_HB1_PWM_EN_Pos     (0UL)                     /*!< HB1_PWM_EN (Bit 0)                                    */
#define TLE9563_HBMODE_HB1_PWM_EN_Msk     (0x1UL)                   /*!< HB1_PWM_EN (Bitfield-Mask: 0x01)                      */
/* =====================================================  TPRECHG_BNK0  ====================================================== */
#define TLE9563_TPRECHG_BNK0_TPCHG3_Pos   (10UL)                    /*!< TPCHG3 (Bit 10)                                       */
#define TLE9563_TPRECHG_BNK0_TPCHG3_Msk   (0x1c00UL)                /*!< TPCHG3 (Bitfield-Mask: 0x07)                          */
#define TLE9563_TPRECHG_BNK0_TPCHG2_Pos   (7UL)                     /*!< TPCHG2 (Bit 7)                                        */
#define TLE9563_TPRECHG_BNK0_TPCHG2_Msk   (0x380UL)                 /*!< TPCHG2 (Bitfield-Mask: 0x07)                          */
#define TLE9563_TPRECHG_BNK0_TPCHG1_Pos   (4UL)                     /*!< TPCHG1 (Bit 4)                                        */
#define TLE9563_TPRECHG_BNK0_TPCHG1_Msk   (0x70UL)                  /*!< TPCHG1 (Bitfield-Mask: 0x07)                          */
#define TLE9563_TPRECHG_BNK0_TPCHG_BNK_Pos (0UL)                    /*!< TPCHG_BNK (Bit 0)                                     */
#define TLE9563_TPRECHG_BNK0_TPCHG_BNK_Msk (0x7UL)                  /*!< TPCHG_BNK (Bitfield-Mask: 0x07)                       */
/* =====================================================  TPRECHG_BNK1  ====================================================== */
#define TLE9563_TPRECHG_BNK1_TPCHG3_Pos   (10UL)                    /*!< TPCHG3 (Bit 10)                                       */
#define TLE9563_TPRECHG_BNK1_TPCHG3_Msk   (0x1c00UL)                /*!< TPCHG3 (Bitfield-Mask: 0x07)                          */
#define TLE9563_TPRECHG_BNK1_TPCHG2_Pos   (7UL)                     /*!< TPCHG2 (Bit 7)                                        */
#define TLE9563_TPRECHG_BNK1_TPCHG2_Msk   (0x380UL)                 /*!< TPCHG2 (Bitfield-Mask: 0x07)                          */
#define TLE9563_TPRECHG_BNK1_TPCHG1_Pos   (4UL)                     /*!< TPCHG1 (Bit 4)                                        */
#define TLE9563_TPRECHG_BNK1_TPCHG1_Msk   (0x70UL)                  /*!< TPCHG1 (Bitfield-Mask: 0x07)                          */
#define TLE9563_TPRECHG_BNK1_TPCHG_BNK_Pos (0UL)                    /*!< TPCHG_BNK (Bit 0)                                     */
#define TLE9563_TPRECHG_BNK1_TPCHG_BNK_Msk (0x7UL)                  /*!< TPCHG_BNK (Bitfield-Mask: 0x07)                       */
/* ========================================================  ST_ICHG  ======================================================== */
#define TLE9563_ST_ICHG_ICHGST3_Pos       (8UL)                     /*!< ICHGST3 (Bit 8)                                       */
#define TLE9563_ST_ICHG_ICHGST3_Msk       (0xf00UL)                 /*!< ICHGST3 (Bitfield-Mask: 0x0f)                         */
#define TLE9563_ST_ICHG_ICHGST2_Pos       (4UL)                     /*!< ICHGST2 (Bit 4)                                       */
#define TLE9563_ST_ICHG_ICHGST2_Msk       (0xf0UL)                  /*!< ICHGST2 (Bitfield-Mask: 0x0f)                         */
#define TLE9563_ST_ICHG_ICHGST1_Pos       (0UL)                     /*!< ICHGST1 (Bit 0)                                       */
#define TLE9563_ST_ICHG_ICHGST1_Msk       (0xfUL)                   /*!< ICHGST1 (Bitfield-Mask: 0x0f)                         */
/* =====================================================  HB_ICHG_BNK0  ====================================================== */
#define TLE9563_HB_ICHG_BNK0_IDCHG_Pos    (10UL)                    /*!< IDCHG (Bit 10)                                        */
#define TLE9563_HB_ICHG_BNK0_IDCHG_Msk    (0xfc00UL)                /*!< IDCHG (Bitfield-Mask: 0x3f)                           */
#define TLE9563_HB_ICHG_BNK0_ICHG_Pos     (4UL)                     /*!< ICHG (Bit 4)                                          */
#define TLE9563_HB_ICHG_BNK0_ICHG_Msk     (0x3f0UL)                 /*!< ICHG (Bitfield-Mask: 0x3f)                            */
#define TLE9563_HB_ICHG_BNK0_ICHG_BNK_Pos (0UL)                     /*!< ICHG_BNK (Bit 0)                                      */
#define TLE9563_HB_ICHG_BNK0_ICHG_BNK_Msk (0x7UL)                   /*!< ICHG_BNK (Bitfield-Mask: 0x07)                        */
/* =====================================================  HB_ICHG_BNK1  ====================================================== */
#define TLE9563_HB_ICHG_BNK1_IDCHG_Pos    (10UL)                    /*!< IDCHG (Bit 10)                                        */
#define TLE9563_HB_ICHG_BNK1_IDCHG_Msk    (0xfc00UL)                /*!< IDCHG (Bitfield-Mask: 0x3f)                           */
#define TLE9563_HB_ICHG_BNK1_ICHG_Pos     (4UL)                     /*!< ICHG (Bit 4)                                          */
#define TLE9563_HB_ICHG_BNK1_ICHG_Msk     (0x3f0UL)                 /*!< ICHG (Bitfield-Mask: 0x3f)                            */
#define TLE9563_HB_ICHG_BNK1_ICHG_BNK_Pos (0UL)                     /*!< ICHG_BNK (Bit 0)                                      */
#define TLE9563_HB_ICHG_BNK1_ICHG_BNK_Msk (0x7UL)                   /*!< ICHG_BNK (Bitfield-Mask: 0x07)                        */
/* =====================================================  HB_ICHG_BNK2  ====================================================== */
#define TLE9563_HB_ICHG_BNK2_IDCHG_Pos    (10UL)                    /*!< IDCHG (Bit 10)                                        */
#define TLE9563_HB_ICHG_BNK2_IDCHG_Msk    (0xfc00UL)                /*!< IDCHG (Bitfield-Mask: 0x3f)                           */
#define TLE9563_HB_ICHG_BNK2_ICHG_Pos     (4UL)                     /*!< ICHG (Bit 4)                                          */
#define TLE9563_HB_ICHG_BNK2_ICHG_Msk     (0x3f0UL)                 /*!< ICHG (Bitfield-Mask: 0x3f)                            */
#define TLE9563_HB_ICHG_BNK2_ICHG_BNK_Pos (0UL)                     /*!< ICHG_BNK (Bit 0)                                      */
#define TLE9563_HB_ICHG_BNK2_ICHG_BNK_Msk (0x7UL)                   /*!< ICHG_BNK (Bitfield-Mask: 0x07)                        */
/* =====================================================  HB_ICHG_BNK4  ====================================================== */
#define TLE9563_HB_ICHG_BNK4_IDCHG_Pos    (10UL)                    /*!< IDCHG (Bit 10)                                        */
#define TLE9563_HB_ICHG_BNK4_IDCHG_Msk    (0xfc00UL)                /*!< IDCHG (Bitfield-Mask: 0x3f)                           */
#define TLE9563_HB_ICHG_BNK4_ICHG_Pos     (4UL)                     /*!< ICHG (Bit 4)                                          */
#define TLE9563_HB_ICHG_BNK4_ICHG_Msk     (0x3f0UL)                 /*!< ICHG (Bitfield-Mask: 0x3f)                            */
#define TLE9563_HB_ICHG_BNK4_ICHG_BNK_Pos (0UL)                     /*!< ICHG_BNK (Bit 0)                                      */
#define TLE9563_HB_ICHG_BNK4_ICHG_BNK_Msk (0x7UL)                   /*!< ICHG_BNK (Bitfield-Mask: 0x07)                        */
/* =====================================================  HB_ICHG_BNK5  ====================================================== */
#define TLE9563_HB_ICHG_BNK5_IDCHG_Pos    (10UL)                    /*!< IDCHG (Bit 10)                                        */
#define TLE9563_HB_ICHG_BNK5_IDCHG_Msk    (0xfc00UL)                /*!< IDCHG (Bitfield-Mask: 0x3f)                           */
#define TLE9563_HB_ICHG_BNK5_ICHG_Pos     (4UL)                     /*!< ICHG (Bit 4)                                          */
#define TLE9563_HB_ICHG_BNK5_ICHG_Msk     (0x3f0UL)                 /*!< ICHG (Bitfield-Mask: 0x3f)                            */
#define TLE9563_HB_ICHG_BNK5_ICHG_BNK_Pos (0UL)                     /*!< ICHG_BNK (Bit 0)                                      */
#define TLE9563_HB_ICHG_BNK5_ICHG_BNK_Msk (0x7UL)                   /*!< ICHG_BNK (Bitfield-Mask: 0x07)                        */
/* =====================================================  HB_ICHG_BNK6  ====================================================== */
#define TLE9563_HB_ICHG_BNK6_IDCHG_Pos    (10UL)                    /*!< IDCHG (Bit 10)                                        */
#define TLE9563_HB_ICHG_BNK6_IDCHG_Msk    (0xfc00UL)                /*!< IDCHG (Bitfield-Mask: 0x3f)                           */
#define TLE9563_HB_ICHG_BNK6_ICHG_Pos     (4UL)                     /*!< ICHG (Bit 4)                                          */
#define TLE9563_HB_ICHG_BNK6_ICHG_Msk     (0x3f0UL)                 /*!< ICHG (Bitfield-Mask: 0x3f)                            */
#define TLE9563_HB_ICHG_BNK6_ICHG_BNK_Pos (0UL)                     /*!< ICHG_BNK (Bit 0)                                      */
#define TLE9563_HB_ICHG_BNK6_ICHG_BNK_Msk (0x7UL)                   /*!< ICHG_BNK (Bitfield-Mask: 0x07)                        */
/* ======================================================  HB_ICHG_MAX  ====================================================== */
#define TLE9563_HB_ICHG_MAX_HB3IDIAG_Pos  (14UL)                    /*!< HB3IDIAG (Bit 14)                                     */
#define TLE9563_HB_ICHG_MAX_HB3IDIAG_Msk  (0x4000UL)                /*!< HB3IDIAG (Bitfield-Mask: 0x01)                        */
#define TLE9563_HB_ICHG_MAX_HB2IDIAG_Pos  (13UL)                    /*!< HB2IDIAG (Bit 13)                                     */
#define TLE9563_HB_ICHG_MAX_HB2IDIAG_Msk  (0x2000UL)                /*!< HB2IDIAG (Bitfield-Mask: 0x01)                        */
#define TLE9563_HB_ICHG_MAX_HB1IDIAG_Pos  (12UL)                    /*!< HB1IDIAG (Bit 12)                                     */
#define TLE9563_HB_ICHG_MAX_HB1IDIAG_Msk  (0x1000UL)                /*!< HB1IDIAG (Bitfield-Mask: 0x01)                        */
#define TLE9563_HB_ICHG_MAX_ICHGMAX3_Pos  (4UL)                     /*!< ICHGMAX3 (Bit 4)                                      */
#define TLE9563_HB_ICHG_MAX_ICHGMAX3_Msk  (0x30UL)                  /*!< ICHGMAX3 (Bitfield-Mask: 0x03)                        */
#define TLE9563_HB_ICHG_MAX_ICHGMAX2_Pos  (2UL)                     /*!< ICHGMAX2 (Bit 2)                                      */
#define TLE9563_HB_ICHG_MAX_ICHGMAX2_Msk  (0xcUL)                   /*!< ICHGMAX2 (Bitfield-Mask: 0x03)                        */
#define TLE9563_HB_ICHG_MAX_ICHGMAX1_Pos  (0UL)                     /*!< ICHGMAX1 (Bit 0)                                      */
#define TLE9563_HB_ICHG_MAX_ICHGMAX1_Msk  (0x3UL)                   /*!< ICHGMAX1 (Bitfield-Mask: 0x03)                        */
/* ===================================================  HB_PCHG_INIT_BNK0  =================================================== */
#define TLE9563_HB_PCHG_INIT_BNK0_PDCHGINIT_Pos (10UL)              /*!< PDCHGINIT (Bit 10)                                    */
#define TLE9563_HB_PCHG_INIT_BNK0_PDCHGINIT_Msk (0xfc00UL)          /*!< PDCHGINIT (Bitfield-Mask: 0x3f)                       */
#define TLE9563_HB_PCHG_INIT_BNK0_PCHGINIT_Pos (4UL)                /*!< PCHGINIT (Bit 4)                                      */
#define TLE9563_HB_PCHG_INIT_BNK0_PCHGINIT_Msk (0x3f0UL)            /*!< PCHGINIT (Bitfield-Mask: 0x3f)                        */
#define TLE9563_HB_PCHG_INIT_BNK0_INIT_BNK_Pos (0UL)                /*!< INIT_BNK (Bit 0)                                      */
