jassony/infineon2b6/TLE9563_LLD/inc/TLE9563.h
#define TLE9563_HB_PCHG_INIT_BNK0_INIT_BNK_Msk (0x7UL)              /*!< INIT_BNK (Bitfield-Mask: 0x07)                        */
/* ===================================================  HB_PCHG_INIT_BNK1  =================================================== */
#define TLE9563_HB_PCHG_INIT_BNK1_PDCHGINIT_Pos (10UL)              /*!< PDCHGINIT (Bit 10)                                    */
#define TLE9563_HB_PCHG_INIT_BNK1_PDCHGINIT_Msk (0xfc00UL)          /*!< PDCHGINIT (Bitfield-Mask: 0x3f)                       */
#define TLE9563_HB_PCHG_INIT_BNK1_PCHGINIT_Pos (4UL)                /*!< PCHGINIT (Bit 4)                                      */
#define TLE9563_HB_PCHG_INIT_BNK1_PCHGINIT_Msk (0x3f0UL)            /*!< PCHGINIT (Bitfield-Mask: 0x3f)                        */
#define TLE9563_HB_PCHG_INIT_BNK1_INIT_BNK_Pos (0UL)                /*!< INIT_BNK (Bit 0)                                      */
#define TLE9563_HB_PCHG_INIT_BNK1_INIT_BNK_Msk (0x7UL)              /*!< INIT_BNK (Bitfield-Mask: 0x07)                        */
/* ===================================================  HB_PCHG_INIT_BNK2  =================================================== */
#define TLE9563_HB_PCHG_INIT_BNK2_PDCHGINIT_Pos (10UL)              /*!< PDCHGINIT (Bit 10)                                    */
#define TLE9563_HB_PCHG_INIT_BNK2_PDCHGINIT_Msk (0xfc00UL)          /*!< PDCHGINIT (Bitfield-Mask: 0x3f)                       */
#define TLE9563_HB_PCHG_INIT_BNK2_PCHGINIT_Pos (4UL)                /*!< PCHGINIT (Bit 4)                                      */
#define TLE9563_HB_PCHG_INIT_BNK2_PCHGINIT_Msk (0x3f0UL)            /*!< PCHGINIT (Bitfield-Mask: 0x3f)                        */
#define TLE9563_HB_PCHG_INIT_BNK2_INIT_BNK_Pos (0UL)                /*!< INIT_BNK (Bit 0)                                      */
#define TLE9563_HB_PCHG_INIT_BNK2_INIT_BNK_Msk (0x7UL)              /*!< INIT_BNK (Bitfield-Mask: 0x07)                        */
/* ===================================================  TDON_HB_CTRL_BNK0  =================================================== */
#define TLE9563_TDON_HB_CTRL_BNK0_TDON_Pos (8UL)                    /*!< TDON (Bit 8)                                          */
#define TLE9563_TDON_HB_CTRL_BNK0_TDON_Msk (0x3f00UL)               /*!< TDON (Bitfield-Mask: 0x3f)                            */
#define TLE9563_TDON_HB_CTRL_BNK0_HB_TDON_BNK_Pos (0UL)             /*!< HB_TDON_BNK (Bit 0)                                   */
#define TLE9563_TDON_HB_CTRL_BNK0_HB_TDON_BNK_Msk (0x7UL)           /*!< HB_TDON_BNK (Bitfield-Mask: 0x07)                     */
/* ===================================================  TDON_HB_CTRL_BNK1  =================================================== */
#define TLE9563_TDON_HB_CTRL_BNK1_TDON_Pos (8UL)                    /*!< TDON (Bit 8)                                          */
#define TLE9563_TDON_HB_CTRL_BNK1_TDON_Msk (0x3f00UL)               /*!< TDON (Bitfield-Mask: 0x3f)                            */
#define TLE9563_TDON_HB_CTRL_BNK1_HB_TDON_BNK_Pos (0UL)             /*!< HB_TDON_BNK (Bit 0)                                   */
#define TLE9563_TDON_HB_CTRL_BNK1_HB_TDON_BNK_Msk (0x7UL)           /*!< HB_TDON_BNK (Bitfield-Mask: 0x07)                     */
/* ===================================================  TDON_HB_CTRL_BNK2  =================================================== */
#define TLE9563_TDON_HB_CTRL_BNK2_TDON_Pos (8UL)                    /*!< TDON (Bit 8)                                          */
#define TLE9563_TDON_HB_CTRL_BNK2_TDON_Msk (0x3f00UL)               /*!< TDON (Bitfield-Mask: 0x3f)                            */
#define TLE9563_TDON_HB_CTRL_BNK2_HB_TDON_BNK_Pos (0UL)             /*!< HB_TDON_BNK (Bit 0)                                   */
#define TLE9563_TDON_HB_CTRL_BNK2_HB_TDON_BNK_Msk (0x7UL)           /*!< HB_TDON_BNK (Bitfield-Mask: 0x07)                     */
/* ==================================================  TDOFF_HB_CTRL_BNK0  =================================================== */
#define TLE9563_TDOFF_HB_CTRL_BNK0_TDOFF_Pos (8UL)                  /*!< TDOFF (Bit 8)                                         */
#define TLE9563_TDOFF_HB_CTRL_BNK0_TDOFF_Msk (0x3f00UL)             /*!< TDOFF (Bitfield-Mask: 0x3f)                           */
#define TLE9563_TDOFF_HB_CTRL_BNK0_HB_TDOFF_BNK_Pos (0UL)           /*!< HB_TDOFF_BNK (Bit 0)                                  */
#define TLE9563_TDOFF_HB_CTRL_BNK0_HB_TDOFF_BNK_Msk (0x7UL)         /*!< HB_TDOFF_BNK (Bitfield-Mask: 0x07)                    */
/* ==================================================  TDOFF_HB_CTRL_BNK1  =================================================== */
#define TLE9563_TDOFF_HB_CTRL_BNK1_TDOFF_Pos (8UL)                  /*!< TDOFF (Bit 8)                                         */
#define TLE9563_TDOFF_HB_CTRL_BNK1_TDOFF_Msk (0x3f00UL)             /*!< TDOFF (Bitfield-Mask: 0x3f)                           */
#define TLE9563_TDOFF_HB_CTRL_BNK1_HB_TDOFF_BNK_Pos (0UL)           /*!< HB_TDOFF_BNK (Bit 0)                                  */
#define TLE9563_TDOFF_HB_CTRL_BNK1_HB_TDOFF_BNK_Msk (0x7UL)         /*!< HB_TDOFF_BNK (Bitfield-Mask: 0x07)                    */
/* ==================================================  TDOFF_HB_CTRL_BNK2  =================================================== */
#define TLE9563_TDOFF_HB_CTRL_BNK2_TDOFF_Pos (8UL)                  /*!< TDOFF (Bit 8)                                         */
#define TLE9563_TDOFF_HB_CTRL_BNK2_TDOFF_Msk (0x3f00UL)             /*!< TDOFF (Bitfield-Mask: 0x3f)                           */
#define TLE9563_TDOFF_HB_CTRL_BNK2_HB_TDOFF_BNK_Pos (0UL)           /*!< HB_TDOFF_BNK (Bit 0)                                  */
#define TLE9563_TDOFF_HB_CTRL_BNK2_HB_TDOFF_BNK_Msk (0x7UL)         /*!< HB_TDOFF_BNK (Bitfield-Mask: 0x07)                    */
/* =========================================================  BRAKE  ========================================================= */
#define TLE9563_BRAKE_SLAM_LS3_DIS_Pos    (12UL)                    /*!< SLAM_LS3_DIS (Bit 12)                                 */
#define TLE9563_BRAKE_SLAM_LS3_DIS_Msk    (0x1000UL)                /*!< SLAM_LS3_DIS (Bitfield-Mask: 0x01)                    */
#define TLE9563_BRAKE_SLAM_LS2_DIS_Pos    (11UL)                    /*!< SLAM_LS2_DIS (Bit 11)                                 */
#define TLE9563_BRAKE_SLAM_LS2_DIS_Msk    (0x800UL)                 /*!< SLAM_LS2_DIS (Bitfield-Mask: 0x01)                    */
#define TLE9563_BRAKE_SLAM_LS1_DIS_Pos    (10UL)                    /*!< SLAM_LS1_DIS (Bit 10)                                 */
#define TLE9563_BRAKE_SLAM_LS1_DIS_Msk    (0x400UL)                 /*!< SLAM_LS1_DIS (Bitfield-Mask: 0x01)                    */
#define TLE9563_BRAKE_SLAM_Pos            (9UL)                     /*!< SLAM (Bit 9)                                          */
#define TLE9563_BRAKE_SLAM_Msk            (0x200UL)                 /*!< SLAM (Bitfield-Mask: 0x01)                            */
#define TLE9563_BRAKE_VDSTH_BRK_Pos       (8UL)                     /*!< VDSTH_BRK (Bit 8)                                     */
#define TLE9563_BRAKE_VDSTH_BRK_Msk       (0x100UL)                 /*!< VDSTH_BRK (Bitfield-Mask: 0x01)                       */
#define TLE9563_BRAKE_TBLK_BRK_Pos        (7UL)                     /*!< TBLK_BRK (Bit 7)                                      */
#define TLE9563_BRAKE_TBLK_BRK_Msk        (0x80UL)                  /*!< TBLK_BRK (Bitfield-Mask: 0x01)                        */
#define TLE9563_BRAKE_PARK_BRK_EN_Pos     (6UL)                     /*!< PARK_BRK_EN (Bit 6)                                   */
#define TLE9563_BRAKE_PARK_BRK_EN_Msk     (0x40UL)                  /*!< PARK_BRK_EN (Bitfield-Mask: 0x01)                     */
#define TLE9563_BRAKE_OV_BRK_EN_Pos       (5UL)                     /*!< OV_BRK_EN (Bit 5)                                     */
#define TLE9563_BRAKE_OV_BRK_EN_Msk       (0x20UL)                  /*!< OV_BRK_EN (Bitfield-Mask: 0x01)                       */
#define TLE9563_BRAKE_OV_BRK_TH_Pos       (0UL)                     /*!< OV_BRK_TH (Bit 0)                                     */
#define TLE9563_BRAKE_OV_BRK_TH_Msk       (0x7UL)                   /*!< OV_BRK_TH (Bitfield-Mask: 0x07)                       */
/* =======================================================  SWK_CTRL  ======================================================== */
#define TLE9563_SWK_CTRL_OSC_CAL_Pos      (7UL)                     /*!< OSC_CAL (Bit 7)                                       */
#define TLE9563_SWK_CTRL_OSC_CAL_Msk      (0x80UL)                  /*!< OSC_CAL (Bitfield-Mask: 0x01)                         */
#define TLE9563_SWK_CTRL_TRIM_EN_Pos      (5UL)                     /*!< TRIM_EN (Bit 5)                                       */
#define TLE9563_SWK_CTRL_TRIM_EN_Msk      (0x60UL)                  /*!< TRIM_EN (Bitfield-Mask: 0x03)                         */
#define TLE9563_SWK_CTRL_CANTO_MASK_Pos   (4UL)                     /*!< CANTO_MASK (Bit 4)                                    */
#define TLE9563_SWK_CTRL_CANTO_MASK_Msk   (0x10UL)                  /*!< CANTO_MASK (Bitfield-Mask: 0x01)                      */
#define TLE9563_SWK_CTRL_CFG_VAL_Pos      (0UL)                     /*!< CFG_VAL (Bit 0)                                       */
#define TLE9563_SWK_CTRL_CFG_VAL_Msk      (0x1UL)                   /*!< CFG_VAL (Bitfield-Mask: 0x01)                         */
/* =====================================================  SWK_BTL1_CTRL  ===================================================== */
#define TLE9563_SWK_BTL1_CTRL_SP_Pos      (10UL)                    /*!< SP (Bit 10)                                           */
#define TLE9563_SWK_BTL1_CTRL_SP_Msk      (0xfc00UL)                /*!< SP (Bitfield-Mask: 0x3f)                              */
#define TLE9563_SWK_BTL1_CTRL_TBIT_Pos    (0UL)                     /*!< TBIT (Bit 0)                                          */
#define TLE9563_SWK_BTL1_CTRL_TBIT_Msk    (0xffUL)                  /*!< TBIT (Bitfield-Mask: 0xff)                            */
/* =====================================================  SWK_ID1_CTRL  ====================================================== */
#define TLE9563_SWK_ID1_CTRL_ID28_Pos     (15UL)                    /*!< ID28 (Bit 15)                                         */
#define TLE9563_SWK_ID1_CTRL_ID28_Msk     (0x8000UL)                /*!< ID28 (Bitfield-Mask: 0x01)                            */
#define TLE9563_SWK_ID1_CTRL_ID27_Pos     (14UL)                    /*!< ID27 (Bit 14)                                         */
#define TLE9563_SWK_ID1_CTRL_ID27_Msk     (0x4000UL)                /*!< ID27 (Bitfield-Mask: 0x01)                            */
#define TLE9563_SWK_ID1_CTRL_ID26_Pos     (13UL)                    /*!< ID26 (Bit 13)                                         */
#define TLE9563_SWK_ID1_CTRL_ID26_Msk     (0x2000UL)                /*!< ID26 (Bitfield-Mask: 0x01)                            */
#define TLE9563_SWK_ID1_CTRL_ID25_Pos     (12UL)                    /*!< ID25 (Bit 12)                                         */
#define TLE9563_SWK_ID1_CTRL_ID25_Msk     (0x1000UL)                /*!< ID25 (Bitfield-Mask: 0x01)                            */
#define TLE9563_SWK_ID1_CTRL_ID24_Pos     (11UL)                    /*!< ID24 (Bit 11)                                         */
#define TLE9563_SWK_ID1_CTRL_ID24_Msk     (0x800UL)                 /*!< ID24 (Bitfield-Mask: 0x01)                            */
#define TLE9563_SWK_ID1_CTRL_ID23_Pos     (10UL)                    /*!< ID23 (Bit 10)                                         */
#define TLE9563_SWK_ID1_CTRL_ID23_Msk     (0x400UL)                 /*!< ID23 (Bitfield-Mask: 0x01)                            */
#define TLE9563_SWK_ID1_CTRL_ID22_Pos     (9UL)                     /*!< ID22 (Bit 9)                                          */
#define TLE9563_SWK_ID1_CTRL_ID22_Msk     (0x200UL)                 /*!< ID22 (Bitfield-Mask: 0x01)                            */
#define TLE9563_SWK_ID1_CTRL_ID21_Pos     (8UL)                     /*!< ID21 (Bit 8)                                          */
#define TLE9563_SWK_ID1_CTRL_ID21_Msk     (0x100UL)                 /*!< ID21 (Bitfield-Mask: 0x01)                            */
#define TLE9563_SWK_ID1_CTRL_ID20_Pos     (7UL)                     /*!< ID20 (Bit 7)                                          */
#define TLE9563_SWK_ID1_CTRL_ID20_Msk     (0x80UL)                  /*!< ID20 (Bitfield-Mask: 0x01)                            */
#define TLE9563_SWK_ID1_CTRL_ID19_Pos     (6UL)                     /*!< ID19 (Bit 6)                                          */
#define TLE9563_SWK_ID1_CTRL_ID19_Msk     (0x40UL)                  /*!< ID19 (Bitfield-Mask: 0x01)                            */
#define TLE9563_SWK_ID1_CTRL_ID18_Pos     (5UL)                     /*!< ID18 (Bit 5)                                          */
#define TLE9563_SWK_ID1_CTRL_ID18_Msk     (0x20UL)                  /*!< ID18 (Bitfield-Mask: 0x01)                            */
#define TLE9563_SWK_ID1_CTRL_ID17_Pos     (4UL)                     /*!< ID17 (Bit 4)                                          */
#define TLE9563_SWK_ID1_CTRL_ID17_Msk     (0x10UL)                  /*!< ID17 (Bitfield-Mask: 0x01)                            */
#define TLE9563_SWK_ID1_CTRL_ID16_Pos     (3UL)                     /*!< ID16 (Bit 3)                                          */
#define TLE9563_SWK_ID1_CTRL_ID16_Msk     (0x8UL)                   /*!< ID16 (Bitfield-Mask: 0x01)                            */
#define TLE9563_SWK_ID1_CTRL_ID15_Pos     (2UL)                     /*!< ID15 (Bit 2)                                          */
#define TLE9563_SWK_ID1_CTRL_ID15_Msk     (0x4UL)                   /*!< ID15 (Bitfield-Mask: 0x01)                            */
#define TLE9563_SWK_ID1_CTRL_ID14_Pos     (1UL)                     /*!< ID14 (Bit 1)                                          */
#define TLE9563_SWK_ID1_CTRL_ID14_Msk     (0x2UL)                   /*!< ID14 (Bitfield-Mask: 0x01)                            */
#define TLE9563_SWK_ID1_CTRL_ID13_Pos     (0UL)                     /*!< ID13 (Bit 0)                                          */
#define TLE9563_SWK_ID1_CTRL_ID13_Msk     (0x1UL)                   /*!< ID13 (Bitfield-Mask: 0x01)                            */
/* =====================================================  SWK_ID0_CTRL  ====================================================== */
#define TLE9563_SWK_ID0_CTRL_ID12_Pos     (15UL)                    /*!< ID12 (Bit 15)                                         */
#define TLE9563_SWK_ID0_CTRL_ID12_Msk     (0x8000UL)                /*!< ID12 (Bitfield-Mask: 0x01)                            */
#define TLE9563_SWK_ID0_CTRL_ID11_Pos     (14UL)                    /*!< ID11 (Bit 14)                                         */
#define TLE9563_SWK_ID0_CTRL_ID11_Msk     (0x4000UL)                /*!< ID11 (Bitfield-Mask: 0x01)                            */
#define TLE9563_SWK_ID0_CTRL_ID10_Pos     (13UL)                    /*!< ID10 (Bit 13)                                         */
#define TLE9563_SWK_ID0_CTRL_ID10_Msk     (0x2000UL)                /*!< ID10 (Bitfield-Mask: 0x01)                            */
#define TLE9563_SWK_ID0_CTRL_ID9_Pos      (12UL)                    /*!< ID9 (Bit 12)                                          */
#define TLE9563_SWK_ID0_CTRL_ID9_Msk      (0x1000UL)                /*!< ID9 (Bitfield-Mask: 0x01)                             */
#define TLE9563_SWK_ID0_CTRL_ID8_Pos      (11UL)                    /*!< ID8 (Bit 11)                                          */
#define TLE9563_SWK_ID0_CTRL_ID8_Msk      (0x800UL)                 /*!< ID8 (Bitfield-Mask: 0x01)                             */
#define TLE9563_SWK_ID0_CTRL_ID7_Pos      (10UL)                    /*!< ID7 (Bit 10)                                          */
#define TLE9563_SWK_ID0_CTRL_ID7_Msk      (0x400UL)                 /*!< ID7 (Bitfield-Mask: 0x01)                             */
#define TLE9563_SWK_ID0_CTRL_ID6_Pos      (9UL)                     /*!< ID6 (Bit 9)                                           */
#define TLE9563_SWK_ID0_CTRL_ID6_Msk      (0x200UL)                 /*!< ID6 (Bitfield-Mask: 0x01)                             */
#define TLE9563_SWK_ID0_CTRL_ID5_Pos      (8UL)                     /*!< ID5 (Bit 8)                                           */
#define TLE9563_SWK_ID0_CTRL_ID5_Msk      (0x100UL)                 /*!< ID5 (Bitfield-Mask: 0x01)                             */
#define TLE9563_SWK_ID0_CTRL_ID4_Pos      (6UL)                     /*!< ID4 (Bit 6)                                           */
#define TLE9563_SWK_ID0_CTRL_ID4_Msk      (0x40UL)                  /*!< ID4 (Bitfield-Mask: 0x01)                             */
#define TLE9563_SWK_ID0_CTRL_ID3_Pos      (5UL)                     /*!< ID3 (Bit 5)                                           */
#define TLE9563_SWK_ID0_CTRL_ID3_Msk      (0x20UL)                  /*!< ID3 (Bitfield-Mask: 0x01)                             */
#define TLE9563_SWK_ID0_CTRL_ID2_Pos      (4UL)                     /*!< ID2 (Bit 4)                                           */
#define TLE9563_SWK_ID0_CTRL_ID2_Msk      (0x10UL)                  /*!< ID2 (Bitfield-Mask: 0x01)                             */
#define TLE9563_SWK_ID0_CTRL_ID1_Pos      (3UL)                     /*!< ID1 (Bit 3)                                           */
#define TLE9563_SWK_ID0_CTRL_ID1_Msk      (0x8UL)                   /*!< ID1 (Bitfield-Mask: 0x01)                             */
#define TLE9563_SWK_ID0_CTRL_ID0_Pos      (2UL)                     /*!< ID0 (Bit 2)                                           */
#define TLE9563_SWK_ID0_CTRL_ID0_Msk      (0x4UL)                   /*!< ID0 (Bitfield-Mask: 0x01)                             */
#define TLE9563_SWK_ID0_CTRL_RTR_Pos      (1UL)                     /*!< RTR (Bit 1)                                           */
#define TLE9563_SWK_ID0_CTRL_RTR_Msk      (0x2UL)                   /*!< RTR (Bitfield-Mask: 0x01)                             */
#define TLE9563_SWK_ID0_CTRL_IDE_Pos      (0UL)                     /*!< IDE (Bit 0)                                           */
#define TLE9563_SWK_ID0_CTRL_IDE_Msk      (0x1UL)                   /*!< IDE (Bitfield-Mask: 0x01)                             */
/* ===================================================  SWK_MASK_ID1_CTRL  =================================================== */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID28_Pos (15UL)              /*!< MASK_ID28 (Bit 15)                                    */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID28_Msk (0x8000UL)          /*!< MASK_ID28 (Bitfield-Mask: 0x01)                       */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID27_Pos (14UL)              /*!< MASK_ID27 (Bit 14)                                    */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID27_Msk (0x4000UL)          /*!< MASK_ID27 (Bitfield-Mask: 0x01)                       */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID26_Pos (13UL)              /*!< MASK_ID26 (Bit 13)                                    */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID26_Msk (0x2000UL)          /*!< MASK_ID26 (Bitfield-Mask: 0x01)                       */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID25_Pos (12UL)              /*!< MASK_ID25 (Bit 12)                                    */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID25_Msk (0x1000UL)          /*!< MASK_ID25 (Bitfield-Mask: 0x01)                       */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID24_Pos (11UL)              /*!< MASK_ID24 (Bit 11)                                    */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID24_Msk (0x800UL)           /*!< MASK_ID24 (Bitfield-Mask: 0x01)                       */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID23_Pos (10UL)              /*!< MASK_ID23 (Bit 10)                                    */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID23_Msk (0x400UL)           /*!< MASK_ID23 (Bitfield-Mask: 0x01)                       */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID22_Pos (9UL)               /*!< MASK_ID22 (Bit 9)                                     */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID22_Msk (0x200UL)           /*!< MASK_ID22 (Bitfield-Mask: 0x01)                       */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID21_Pos (8UL)               /*!< MASK_ID21 (Bit 8)                                     */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID21_Msk (0x100UL)           /*!< MASK_ID21 (Bitfield-Mask: 0x01)                       */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID20_Pos (7UL)               /*!< MASK_ID20 (Bit 7)                                     */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID20_Msk (0x80UL)            /*!< MASK_ID20 (Bitfield-Mask: 0x01)                       */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID19_Pos (6UL)               /*!< MASK_ID19 (Bit 6)                                     */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID19_Msk (0x40UL)            /*!< MASK_ID19 (Bitfield-Mask: 0x01)                       */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID18_Pos (5UL)               /*!< MASK_ID18 (Bit 5)                                     */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID18_Msk (0x20UL)            /*!< MASK_ID18 (Bitfield-Mask: 0x01)                       */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID17_Pos (4UL)               /*!< MASK_ID17 (Bit 4)                                     */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID17_Msk (0x10UL)            /*!< MASK_ID17 (Bitfield-Mask: 0x01)                       */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID16_Pos (3UL)               /*!< MASK_ID16 (Bit 3)                                     */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID16_Msk (0x8UL)             /*!< MASK_ID16 (Bitfield-Mask: 0x01)                       */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID15_Pos (2UL)               /*!< MASK_ID15 (Bit 2)                                     */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID15_Msk (0x4UL)             /*!< MASK_ID15 (Bitfield-Mask: 0x01)                       */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID14_Pos (1UL)               /*!< MASK_ID14 (Bit 1)                                     */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID14_Msk (0x2UL)             /*!< MASK_ID14 (Bitfield-Mask: 0x01)                       */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID13_Pos (0UL)               /*!< MASK_ID13 (Bit 0)                                     */
#define TLE9563_SWK_MASK_ID1_CTRL_MASK_ID13_Msk (0x1UL)             /*!< MASK_ID13 (Bitfield-Mask: 0x01)                       */
/* ===================================================  SWK_MASK_ID0_CTRL  =================================================== */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID12_Pos (15UL)              /*!< MASK_ID12 (Bit 15)                                    */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID12_Msk (0x8000UL)          /*!< MASK_ID12 (Bitfield-Mask: 0x01)                       */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID11_Pos (14UL)              /*!< MASK_ID11 (Bit 14)                                    */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID11_Msk (0x4000UL)          /*!< MASK_ID11 (Bitfield-Mask: 0x01)                       */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID10_Pos (13UL)              /*!< MASK_ID10 (Bit 13)                                    */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID10_Msk (0x2000UL)          /*!< MASK_ID10 (Bitfield-Mask: 0x01)                       */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID9_Pos (12UL)               /*!< MASK_ID9 (Bit 12)                                     */
