jassony/infineon2b6/TLE9563_LLD/inc/TLE9563.h
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID9_Msk (0x1000UL)           /*!< MASK_ID9 (Bitfield-Mask: 0x01)                        */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID8_Pos (11UL)               /*!< MASK_ID8 (Bit 11)                                     */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID8_Msk (0x800UL)            /*!< MASK_ID8 (Bitfield-Mask: 0x01)                        */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID7_Pos (10UL)               /*!< MASK_ID7 (Bit 10)                                     */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID7_Msk (0x400UL)            /*!< MASK_ID7 (Bitfield-Mask: 0x01)                        */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID6_Pos (9UL)                /*!< MASK_ID6 (Bit 9)                                      */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID6_Msk (0x200UL)            /*!< MASK_ID6 (Bitfield-Mask: 0x01)                        */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID5_Pos (8UL)                /*!< MASK_ID5 (Bit 8)                                      */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID5_Msk (0x100UL)            /*!< MASK_ID5 (Bitfield-Mask: 0x01)                        */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID4_Pos (6UL)                /*!< MASK_ID4 (Bit 6)                                      */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID4_Msk (0x40UL)             /*!< MASK_ID4 (Bitfield-Mask: 0x01)                        */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID3_Pos (5UL)                /*!< MASK_ID3 (Bit 5)                                      */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID3_Msk (0x20UL)             /*!< MASK_ID3 (Bitfield-Mask: 0x01)                        */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID2_Pos (4UL)                /*!< MASK_ID2 (Bit 4)                                      */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID2_Msk (0x10UL)             /*!< MASK_ID2 (Bitfield-Mask: 0x01)                        */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID1_Pos (3UL)                /*!< MASK_ID1 (Bit 3)                                      */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID1_Msk (0x8UL)              /*!< MASK_ID1 (Bitfield-Mask: 0x01)                        */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID0_Pos (2UL)                /*!< MASK_ID0 (Bit 2)                                      */
#define TLE9563_SWK_MASK_ID0_CTRL_MASK_ID0_Msk (0x4UL)              /*!< MASK_ID0 (Bitfield-Mask: 0x01)                        */
/* =====================================================  SWK_DLC_CTRL  ====================================================== */
#define TLE9563_SWK_DLC_CTRL_DLC_Pos      (0UL)                     /*!< DLC (Bit 0)                                           */
#define TLE9563_SWK_DLC_CTRL_DLC_Msk      (0xfUL)                   /*!< DLC (Bitfield-Mask: 0x0f)                             */
/* ====================================================  SWK_DATA3_CTRL  ===================================================== */
#define TLE9563_SWK_DATA3_CTRL_DATA7_Pos  (8UL)                     /*!< DATA7 (Bit 8)                                         */
#define TLE9563_SWK_DATA3_CTRL_DATA7_Msk  (0xff00UL)                /*!< DATA7 (Bitfield-Mask: 0xff)                           */
#define TLE9563_SWK_DATA3_CTRL_DATA6_Pos  (0UL)                     /*!< DATA6 (Bit 0)                                         */
#define TLE9563_SWK_DATA3_CTRL_DATA6_Msk  (0xffUL)                  /*!< DATA6 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SWK_DATA2_CTRL  ===================================================== */
#define TLE9563_SWK_DATA2_CTRL_DATA5_Pos  (8UL)                     /*!< DATA5 (Bit 8)                                         */
#define TLE9563_SWK_DATA2_CTRL_DATA5_Msk  (0xff00UL)                /*!< DATA5 (Bitfield-Mask: 0xff)                           */
#define TLE9563_SWK_DATA2_CTRL_DATA4_Pos  (0UL)                     /*!< DATA4 (Bit 0)                                         */
#define TLE9563_SWK_DATA2_CTRL_DATA4_Msk  (0xffUL)                  /*!< DATA4 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SWK_DATA1_CTRL  ===================================================== */
#define TLE9563_SWK_DATA1_CTRL_DATA3_Pos  (8UL)                     /*!< DATA3 (Bit 8)                                         */
#define TLE9563_SWK_DATA1_CTRL_DATA3_Msk  (0xff00UL)                /*!< DATA3 (Bitfield-Mask: 0xff)                           */
#define TLE9563_SWK_DATA1_CTRL_DATA2_Pos  (0UL)                     /*!< DATA2 (Bit 0)                                         */
#define TLE9563_SWK_DATA1_CTRL_DATA2_Msk  (0xffUL)                  /*!< DATA2 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SWK_DATA0_CTRL  ===================================================== */
#define TLE9563_SWK_DATA0_CTRL_DATA1_Pos  (8UL)                     /*!< DATA1 (Bit 8)                                         */
#define TLE9563_SWK_DATA0_CTRL_DATA1_Msk  (0xff00UL)                /*!< DATA1 (Bitfield-Mask: 0xff)                           */
#define TLE9563_SWK_DATA0_CTRL_DATA0_Pos  (0UL)                     /*!< DATA0 (Bit 0)                                         */
#define TLE9563_SWK_DATA0_CTRL_DATA0_Msk  (0xffUL)                  /*!< DATA0 (Bitfield-Mask: 0xff)                           */
/* ====================================================  SWK_CAN_FD_CTRL  ==================================================== */
#define TLE9563_SWK_CAN_FD_CTRL_DIS_ERR_CNT_Pos (5UL)               /*!< DIS_ERR_CNT (Bit 5)                                   */
#define TLE9563_SWK_CAN_FD_CTRL_DIS_ERR_CNT_Msk (0x20UL)            /*!< DIS_ERR_CNT (Bitfield-Mask: 0x01)                     */
#define TLE9563_SWK_CAN_FD_CTRL_FD_FILTER_Pos (1UL)                 /*!< FD_FILTER (Bit 1)                                     */
#define TLE9563_SWK_CAN_FD_CTRL_FD_FILTER_Msk (0xeUL)               /*!< FD_FILTER (Bitfield-Mask: 0x07)                       */
#define TLE9563_SWK_CAN_FD_CTRL_CAN_FD_EN_Pos (0UL)                 /*!< CAN_FD_EN (Bit 0)                                     */
#define TLE9563_SWK_CAN_FD_CTRL_CAN_FD_EN_Msk (0x1UL)               /*!< CAN_FD_EN (Bitfield-Mask: 0x01)                       */
/* ===================================================  SWK_OSC_TRIM_CTRL  =================================================== */
#define TLE9563_SWK_OSC_TRIM_CTRL_RX_WK_SEL_Pos (14UL)              /*!< RX_WK_SEL (Bit 14)                                    */
#define TLE9563_SWK_OSC_TRIM_CTRL_RX_WK_SEL_Msk (0x4000UL)          /*!< RX_WK_SEL (Bitfield-Mask: 0x01)                       */
#define TLE9563_SWK_OSC_TRIM_CTRL_TEMP_COEF_Pos (7UL)               /*!< TEMP_COEF (Bit 7)                                     */
#define TLE9563_SWK_OSC_TRIM_CTRL_TEMP_COEF_Msk (0xf80UL)           /*!< TEMP_COEF (Bitfield-Mask: 0x1f)                       */
#define TLE9563_SWK_OSC_TRIM_CTRL_TRIM_OSC_Pos (0UL)                /*!< TRIM_OSC (Bit 0)                                      */
#define TLE9563_SWK_OSC_TRIM_CTRL_TRIM_OSC_Msk (0x7fUL)             /*!< TRIM_OSC (Bitfield-Mask: 0x7f)                        */
/* ===================================================  SWK_OSC_CAL_STAT  ==================================================== */
#define TLE9563_SWK_OSC_CAL_STAT_OSC_CAL_H_Pos (8UL)                /*!< OSC_CAL_H (Bit 8)                                     */
#define TLE9563_SWK_OSC_CAL_STAT_OSC_CAL_H_Msk (0xff00UL)           /*!< OSC_CAL_H (Bitfield-Mask: 0xff)                       */
#define TLE9563_SWK_OSC_CAL_STAT_OSC_CAL_L_Pos (0UL)                /*!< OSC_CAL_L (Bit 0)                                     */
#define TLE9563_SWK_OSC_CAL_STAT_OSC_CAL_L_Msk (0xffUL)             /*!< OSC_CAL_L (Bitfield-Mask: 0xff)                       */
/* =====================================================  SWK_CDR_CTRL  ====================================================== */
#define TLE9563_SWK_CDR_CTRL_SEL_OSC_CLK_Pos (5UL)                  /*!< SEL_OSC_CLK (Bit 5)                                   */
#define TLE9563_SWK_CDR_CTRL_SEL_OSC_CLK_Msk (0x60UL)               /*!< SEL_OSC_CLK (Bitfield-Mask: 0x03)                     */
#define TLE9563_SWK_CDR_CTRL_SELFILT_Pos  (2UL)                     /*!< SELFILT (Bit 2)                                       */
#define TLE9563_SWK_CDR_CTRL_SELFILT_Msk  (0xcUL)                   /*!< SELFILT (Bitfield-Mask: 0x03)                         */
#define TLE9563_SWK_CDR_CTRL_CDR_EN_Pos   (0UL)                     /*!< CDR_EN (Bit 0)                                        */
#define TLE9563_SWK_CDR_CTRL_CDR_EN_Msk   (0x1UL)                   /*!< CDR_EN (Bitfield-Mask: 0x01)                          */
/* =====================================================  SWK_CDR_LIMIT  ===================================================== */
#define TLE9563_SWK_CDR_LIMIT_CDR_LIM_H_Pos (8UL)                   /*!< CDR_LIM_H (Bit 8)                                     */
#define TLE9563_SWK_CDR_LIMIT_CDR_LIM_H_Msk (0xff00UL)              /*!< CDR_LIM_H (Bitfield-Mask: 0xff)                       */
#define TLE9563_SWK_CDR_LIMIT_CDR_LIM_L_Pos (0UL)                   /*!< CDR_LIM_L (Bit 0)                                     */
#define TLE9563_SWK_CDR_LIMIT_CDR_LIM_L_Msk (0xffUL)                /*!< CDR_LIM_L (Bitfield-Mask: 0xff)                       */
/* =======================================================  SUP_STAT  ======================================================== */
#define TLE9563_SUP_STAT_POR_Pos          (15UL)                    /*!< POR (Bit 15)                                          */
#define TLE9563_SUP_STAT_POR_Msk          (0x8000UL)                /*!< POR (Bitfield-Mask: 0x01)                             */
#define TLE9563_SUP_STAT_CP_OT_Pos        (12UL)                    /*!< CP_OT (Bit 12)                                        */
#define TLE9563_SUP_STAT_CP_OT_Msk        (0x1000UL)                /*!< CP_OT (Bitfield-Mask: 0x01)                           */
#define TLE9563_SUP_STAT_VCC1_UV_FS_Pos   (11UL)                    /*!< VCC1_UV_FS (Bit 11)                                   */
#define TLE9563_SUP_STAT_VCC1_UV_FS_Msk   (0x800UL)                 /*!< VCC1_UV_FS (Bitfield-Mask: 0x01)                      */
#define TLE9563_SUP_STAT_HS_UV_Pos        (10UL)                    /*!< HS_UV (Bit 10)                                        */
#define TLE9563_SUP_STAT_HS_UV_Msk        (0x400UL)                 /*!< HS_UV (Bitfield-Mask: 0x01)                           */
#define TLE9563_SUP_STAT_HS_OV_Pos        (9UL)                     /*!< HS_OV (Bit 9)                                         */
#define TLE9563_SUP_STAT_HS_OV_Msk        (0x200UL)                 /*!< HS_OV (Bitfield-Mask: 0x01)                           */
#define TLE9563_SUP_STAT_VSINT_UV_Pos     (8UL)                     /*!< VSINT_UV (Bit 8)                                      */
#define TLE9563_SUP_STAT_VSINT_UV_Msk     (0x100UL)                 /*!< VSINT_UV (Bitfield-Mask: 0x01)                        */
#define TLE9563_SUP_STAT_VSINT_OV_Pos     (7UL)                     /*!< VSINT_OV (Bit 7)                                      */
#define TLE9563_SUP_STAT_VSINT_OV_Msk     (0x80UL)                  /*!< VSINT_OV (Bitfield-Mask: 0x01)                        */
#define TLE9563_SUP_STAT_VS_UV_Pos        (6UL)                     /*!< VS_UV (Bit 6)                                         */
#define TLE9563_SUP_STAT_VS_UV_Msk        (0x40UL)                  /*!< VS_UV (Bitfield-Mask: 0x01)                           */
#define TLE9563_SUP_STAT_VS_OV_Pos        (5UL)                     /*!< VS_OV (Bit 5)                                         */
#define TLE9563_SUP_STAT_VS_OV_Msk        (0x20UL)                  /*!< VS_OV (Bitfield-Mask: 0x01)                           */
#define TLE9563_SUP_STAT_CP_UV_Pos        (4UL)                     /*!< CP_UV (Bit 4)                                         */
#define TLE9563_SUP_STAT_CP_UV_Msk        (0x10UL)                  /*!< CP_UV (Bitfield-Mask: 0x01)                           */
#define TLE9563_SUP_STAT_VCC1_SC_Pos      (3UL)                     /*!< VCC1_SC (Bit 3)                                       */
#define TLE9563_SUP_STAT_VCC1_SC_Msk      (0x8UL)                   /*!< VCC1_SC (Bitfield-Mask: 0x01)                         */
#define TLE9563_SUP_STAT_VCC1_UV_Pos      (2UL)                     /*!< VCC1_UV (Bit 2)                                       */
#define TLE9563_SUP_STAT_VCC1_UV_Msk      (0x4UL)                   /*!< VCC1_UV (Bitfield-Mask: 0x01)                         */
#define TLE9563_SUP_STAT_VCC1_OV_Pos      (1UL)                     /*!< VCC1_OV (Bit 1)                                       */
#define TLE9563_SUP_STAT_VCC1_OV_Msk      (0x2UL)                   /*!< VCC1_OV (Bitfield-Mask: 0x01)                         */
#define TLE9563_SUP_STAT_VCC1_WARN_Pos    (0UL)                     /*!< VCC1_WARN (Bit 0)                                     */
#define TLE9563_SUP_STAT_VCC1_WARN_Msk    (0x1UL)                   /*!< VCC1_WARN (Bitfield-Mask: 0x01)                       */
/* ======================================================  THERM_STAT  ======================================================= */
#define TLE9563_THERM_STAT_TSD2_SAFE_Pos  (3UL)                     /*!< TSD2_SAFE (Bit 3)                                     */
#define TLE9563_THERM_STAT_TSD2_SAFE_Msk  (0x8UL)                   /*!< TSD2_SAFE (Bitfield-Mask: 0x01)                       */
#define TLE9563_THERM_STAT_TSD2_Pos       (2UL)                     /*!< TSD2 (Bit 2)                                          */
#define TLE9563_THERM_STAT_TSD2_Msk       (0x4UL)                   /*!< TSD2 (Bitfield-Mask: 0x01)                            */
#define TLE9563_THERM_STAT_TSD1_Pos       (1UL)                     /*!< TSD1 (Bit 1)                                          */
#define TLE9563_THERM_STAT_TSD1_Msk       (0x2UL)                   /*!< TSD1 (Bitfield-Mask: 0x01)                            */
#define TLE9563_THERM_STAT_TPW_Pos        (0UL)                     /*!< TPW (Bit 0)                                           */
#define TLE9563_THERM_STAT_TPW_Msk        (0x1UL)                   /*!< TPW (Bitfield-Mask: 0x01)                             */
/* =======================================================  DEV_STAT  ======================================================== */
#define TLE9563_DEV_STAT_CRC_STAT_Pos     (9UL)                     /*!< CRC_STAT (Bit 9)                                      */
#define TLE9563_DEV_STAT_CRC_STAT_Msk     (0x200UL)                 /*!< CRC_STAT (Bitfield-Mask: 0x01)                        */
#define TLE9563_DEV_STAT_CRC_FAIL_Pos     (8UL)                     /*!< CRC_FAIL (Bit 8)                                      */
#define TLE9563_DEV_STAT_CRC_FAIL_Msk     (0x100UL)                 /*!< CRC_FAIL (Bitfield-Mask: 0x01)                        */
#define TLE9563_DEV_STAT_DEV_STAT_Pos     (6UL)                     /*!< DEV_STAT (Bit 6)                                      */
#define TLE9563_DEV_STAT_DEV_STAT_Msk     (0xc0UL)                  /*!< DEV_STAT (Bitfield-Mask: 0x03)                        */
#define TLE9563_DEV_STAT_SW_DEV_Pos       (4UL)                     /*!< SW_DEV (Bit 4)                                        */
#define TLE9563_DEV_STAT_SW_DEV_Msk       (0x10UL)                  /*!< SW_DEV (Bitfield-Mask: 0x01)                          */
#define TLE9563_DEV_STAT_WD_FAIL_Pos      (2UL)                     /*!< WD_FAIL (Bit 2)                                       */
#define TLE9563_DEV_STAT_WD_FAIL_Msk      (0xcUL)                   /*!< WD_FAIL (Bitfield-Mask: 0x03)                         */
#define TLE9563_DEV_STAT_SPI_FAIL_Pos     (1UL)                     /*!< SPI_FAIL (Bit 1)                                      */
#define TLE9563_DEV_STAT_SPI_FAIL_Msk     (0x2UL)                   /*!< SPI_FAIL (Bitfield-Mask: 0x01)                        */
#define TLE9563_DEV_STAT_FAILURE_Pos      (0UL)                     /*!< FAILURE (Bit 0)                                       */
#define TLE9563_DEV_STAT_FAILURE_Msk      (0x1UL)                   /*!< FAILURE (Bitfield-Mask: 0x01)                         */
/* =======================================================  BUS_STAT  ======================================================== */
#define TLE9563_BUS_STAT_CANTO_Pos        (4UL)                     /*!< CANTO (Bit 4)                                         */
#define TLE9563_BUS_STAT_CANTO_Msk        (0x10UL)                  /*!< CANTO (Bitfield-Mask: 0x01)                           */
#define TLE9563_BUS_STAT_SYSERR_Pos       (3UL)                     /*!< SYSERR (Bit 3)                                        */
#define TLE9563_BUS_STAT_SYSERR_Msk       (0x8UL)                   /*!< SYSERR (Bitfield-Mask: 0x01)                          */
#define TLE9563_BUS_STAT_CAN_FAIL_Pos     (1UL)                     /*!< CAN_FAIL (Bit 1)                                      */
#define TLE9563_BUS_STAT_CAN_FAIL_Msk     (0x6UL)                   /*!< CAN_FAIL (Bitfield-Mask: 0x03)                        */
#define TLE9563_BUS_STAT_VCAN_UV_Pos      (0UL)                     /*!< VCAN_UV (Bit 0)                                       */
#define TLE9563_BUS_STAT_VCAN_UV_Msk      (0x1UL)                   /*!< VCAN_UV (Bitfield-Mask: 0x01)                         */
/* ========================================================  WK_STAT  ======================================================== */
#define TLE9563_WK_STAT_CAN_WU_Pos        (9UL)                     /*!< CAN_WU (Bit 9)                                        */
#define TLE9563_WK_STAT_CAN_WU_Msk        (0x200UL)                 /*!< CAN_WU (Bitfield-Mask: 0x01)                          */
#define TLE9563_WK_STAT_TIMER2_WU_Pos     (8UL)                     /*!< TIMER2_WU (Bit 8)                                     */
#define TLE9563_WK_STAT_TIMER2_WU_Msk     (0x100UL)                 /*!< TIMER2_WU (Bitfield-Mask: 0x01)                       */
#define TLE9563_WK_STAT_TIMER1_WU_Pos     (7UL)                     /*!< TIMER1_WU (Bit 7)                                     */
#define TLE9563_WK_STAT_TIMER1_WU_Msk     (0x80UL)                  /*!< TIMER1_WU (Bitfield-Mask: 0x01)                       */
#define TLE9563_WK_STAT_WK5_WU_Pos        (4UL)                     /*!< WK5_WU (Bit 4)                                        */
#define TLE9563_WK_STAT_WK5_WU_Msk        (0x10UL)                  /*!< WK5_WU (Bitfield-Mask: 0x01)                          */
#define TLE9563_WK_STAT_WK4_WU_Pos        (3UL)                     /*!< WK4_WU (Bit 3)                                        */
#define TLE9563_WK_STAT_WK4_WU_Msk        (0x8UL)                   /*!< WK4_WU (Bitfield-Mask: 0x01)                          */
/* ======================================================  WK_LVL_STAT  ====================================================== */
#define TLE9563_WK_LVL_STAT_WK5_LVL_Pos   (4UL)                     /*!< WK5_LVL (Bit 4)                                       */
#define TLE9563_WK_LVL_STAT_WK5_LVL_Msk   (0x10UL)                  /*!< WK5_LVL (Bitfield-Mask: 0x01)                         */
#define TLE9563_WK_LVL_STAT_WK4_LVL_Pos   (3UL)                     /*!< WK4_LVL (Bit 3)                                       */
#define TLE9563_WK_LVL_STAT_WK4_LVL_Msk   (0x8UL)                   /*!< WK4_LVL (Bitfield-Mask: 0x01)                         */
/* ===================================================  HS_OL_OC_OT_STAT  ==================================================== */
#define TLE9563_HS_OL_OC_OT_STAT_HS3_OT_Pos (12UL)                  /*!< HS3_OT (Bit 12)                                       */
#define TLE9563_HS_OL_OC_OT_STAT_HS3_OT_Msk (0x1000UL)              /*!< HS3_OT (Bitfield-Mask: 0x01)                          */
#define TLE9563_HS_OL_OC_OT_STAT_HS2_OT_Pos (11UL)                  /*!< HS2_OT (Bit 11)                                       */
#define TLE9563_HS_OL_OC_OT_STAT_HS2_OT_Msk (0x800UL)               /*!< HS2_OT (Bitfield-Mask: 0x01)                          */
#define TLE9563_HS_OL_OC_OT_STAT_HS1_OT_Pos (10UL)                  /*!< HS1_OT (Bit 10)                                       */
#define TLE9563_HS_OL_OC_OT_STAT_HS1_OT_Msk (0x400UL)               /*!< HS1_OT (Bitfield-Mask: 0x01)                          */
#define TLE9563_HS_OL_OC_OT_STAT_HS3_OL_Pos (7UL)                   /*!< HS3_OL (Bit 7)                                        */
#define TLE9563_HS_OL_OC_OT_STAT_HS3_OL_Msk (0x80UL)                /*!< HS3_OL (Bitfield-Mask: 0x01)                          */
#define TLE9563_HS_OL_OC_OT_STAT_HS2_OL_Pos (6UL)                   /*!< HS2_OL (Bit 6)                                        */
#define TLE9563_HS_OL_OC_OT_STAT_HS2_OL_Msk (0x40UL)                /*!< HS2_OL (Bitfield-Mask: 0x01)                          */
#define TLE9563_HS_OL_OC_OT_STAT_HS1_OL_Pos (5UL)                   /*!< HS1_OL (Bit 5)                                        */
#define TLE9563_HS_OL_OC_OT_STAT_HS1_OL_Msk (0x20UL)                /*!< HS1_OL (Bitfield-Mask: 0x01)                          */
#define TLE9563_HS_OL_OC_OT_STAT_HS3_OC_Pos (2UL)                   /*!< HS3_OC (Bit 2)                                        */
#define TLE9563_HS_OL_OC_OT_STAT_HS3_OC_Msk (0x4UL)                 /*!< HS3_OC (Bitfield-Mask: 0x01)                          */
#define TLE9563_HS_OL_OC_OT_STAT_HS2_OC_Pos (1UL)                   /*!< HS2_OC (Bit 1)                                        */
#define TLE9563_HS_OL_OC_OT_STAT_HS2_OC_Msk (0x2UL)                 /*!< HS2_OC (Bitfield-Mask: 0x01)                          */
#define TLE9563_HS_OL_OC_OT_STAT_HS1_OC_Pos (0UL)                   /*!< HS1_OC (Bit 0)                                        */
#define TLE9563_HS_OL_OC_OT_STAT_HS1_OC_Msk (0x1UL)                 /*!< HS1_OC (Bitfield-Mask: 0x01)                          */
/* =======================================================  GEN_STAT  ======================================================== */
#define TLE9563_GEN_STAT_HB3VOUT_Pos      (8UL)                     /*!< HB3VOUT (Bit 8)                                       */
#define TLE9563_GEN_STAT_HB3VOUT_Msk      (0x100UL)                 /*!< HB3VOUT (Bitfield-Mask: 0x01)                         */
#define TLE9563_GEN_STAT_HB2VOUT_Pos      (7UL)                     /*!< HB2VOUT (Bit 7)                                       */
#define TLE9563_GEN_STAT_HB2VOUT_Msk      (0x80UL)                  /*!< HB2VOUT (Bitfield-Mask: 0x01)                         */
#define TLE9563_GEN_STAT_HB1VOUT_Pos      (6UL)                     /*!< HB1VOUT (Bit 6)                                       */
#define TLE9563_GEN_STAT_HB1VOUT_Msk      (0x40UL)                  /*!< HB1VOUT (Bitfield-Mask: 0x01)                         */
#define TLE9563_GEN_STAT_PWM6STAT_Pos     (5UL)                     /*!< PWM6STAT (Bit 5)                                      */
#define TLE9563_GEN_STAT_PWM6STAT_Msk     (0x20UL)                  /*!< PWM6STAT (Bitfield-Mask: 0x01)                        */
#define TLE9563_GEN_STAT_PWM5STAT_Pos     (4UL)                     /*!< PWM5STAT (Bit 4)                                      */
#define TLE9563_GEN_STAT_PWM5STAT_Msk     (0x10UL)                  /*!< PWM5STAT (Bitfield-Mask: 0x01)                        */
#define TLE9563_GEN_STAT_PWM4STAT_Pos     (3UL)                     /*!< PWM4STAT (Bit 3)                                      */
#define TLE9563_GEN_STAT_PWM4STAT_Msk     (0x8UL)                   /*!< PWM4STAT (Bitfield-Mask: 0x01)                        */
