jassony/infineon2b6/TLE9563_LLD/inc/TLE9563.h
#define TLE9563_GEN_STAT_PWM3STAT_Pos     (2UL)                     /*!< PWM3STAT (Bit 2)                                      */
#define TLE9563_GEN_STAT_PWM3STAT_Msk     (0x4UL)                   /*!< PWM3STAT (Bitfield-Mask: 0x01)                        */
#define TLE9563_GEN_STAT_PWM2STAT_Pos     (1UL)                     /*!< PWM2STAT (Bit 1)                                      */
#define TLE9563_GEN_STAT_PWM2STAT_Msk     (0x2UL)                   /*!< PWM2STAT (Bitfield-Mask: 0x01)                        */
#define TLE9563_GEN_STAT_PWM1STAT_Pos     (0UL)                     /*!< PWM1STAT (Bit 0)                                      */
#define TLE9563_GEN_STAT_PWM1STAT_Msk     (0x1UL)                   /*!< PWM1STAT (Bitfield-Mask: 0x01)                        */
/* =========================================================  TDREG  ========================================================= */
#define TLE9563_TDREG_IPDCHG3_ST_Pos      (10UL)                    /*!< IPDCHG3_ST (Bit 10)                                   */
#define TLE9563_TDREG_IPDCHG3_ST_Msk      (0x400UL)                 /*!< IPDCHG3_ST (Bitfield-Mask: 0x01)                      */
#define TLE9563_TDREG_IPDCHG2_ST_Pos      (9UL)                     /*!< IPDCHG2_ST (Bit 9)                                    */
#define TLE9563_TDREG_IPDCHG2_ST_Msk      (0x200UL)                 /*!< IPDCHG2_ST (Bitfield-Mask: 0x01)                      */
#define TLE9563_TDREG_IPDCHG1_ST_Pos      (8UL)                     /*!< IPDCHG1_ST (Bit 8)                                    */
#define TLE9563_TDREG_IPDCHG1_ST_Msk      (0x100UL)                 /*!< IPDCHG1_ST (Bitfield-Mask: 0x01)                      */
#define TLE9563_TDREG_IPCHG3_ST_Pos       (6UL)                     /*!< IPCHG3_ST (Bit 6)                                     */
#define TLE9563_TDREG_IPCHG3_ST_Msk       (0x40UL)                  /*!< IPCHG3_ST (Bitfield-Mask: 0x01)                       */
#define TLE9563_TDREG_IPCHG2_ST_Pos       (5UL)                     /*!< IPCHG2_ST (Bit 5)                                     */
#define TLE9563_TDREG_IPCHG2_ST_Msk       (0x20UL)                  /*!< IPCHG2_ST (Bitfield-Mask: 0x01)                       */
#define TLE9563_TDREG_IPCHG1_ST_Pos       (4UL)                     /*!< IPCHG1_ST (Bit 4)                                     */
#define TLE9563_TDREG_IPCHG1_ST_Msk       (0x10UL)                  /*!< IPCHG1_ST (Bitfield-Mask: 0x01)                       */
#define TLE9563_TDREG_TDREG3_Pos          (2UL)                     /*!< TDREG3 (Bit 2)                                        */
#define TLE9563_TDREG_TDREG3_Msk          (0x4UL)                   /*!< TDREG3 (Bitfield-Mask: 0x01)                          */
#define TLE9563_TDREG_TDREG2_Pos          (1UL)                     /*!< TDREG2 (Bit 1)                                        */
#define TLE9563_TDREG_TDREG2_Msk          (0x2UL)                   /*!< TDREG2 (Bitfield-Mask: 0x01)                          */
#define TLE9563_TDREG_TDREG1_Pos          (0UL)                     /*!< TDREG1 (Bit 0)                                        */
#define TLE9563_TDREG_TDREG1_Msk          (0x1UL)                   /*!< TDREG1 (Bitfield-Mask: 0x01)                          */
/* =========================================================  DSOV  ========================================================== */
#define TLE9563_DSOV_OC_CSA_Pos           (14UL)                    /*!< OC_CSA (Bit 14)                                       */
#define TLE9563_DSOV_OC_CSA_Msk           (0x4000UL)                /*!< OC_CSA (Bitfield-Mask: 0x01)                          */
#define TLE9563_DSOV_VSINTOVBRAKE_ST_Pos  (13UL)                    /*!< VSINTOVBRAKE_ST (Bit 13)                              */
#define TLE9563_DSOV_VSINTOVBRAKE_ST_Msk  (0x2000UL)                /*!< VSINTOVBRAKE_ST (Bitfield-Mask: 0x01)                 */
#define TLE9563_DSOV_VSOVBRAKE_ST_Pos     (12UL)                    /*!< VSOVBRAKE_ST (Bit 12)                                 */
#define TLE9563_DSOV_VSOVBRAKE_ST_Msk     (0x1000UL)                /*!< VSOVBRAKE_ST (Bitfield-Mask: 0x01)                    */
#define TLE9563_DSOV_LS3DSOV_BRK_Pos      (10UL)                    /*!< LS3DSOV_BRK (Bit 10)                                  */
#define TLE9563_DSOV_LS3DSOV_BRK_Msk      (0x400UL)                 /*!< LS3DSOV_BRK (Bitfield-Mask: 0x01)                     */
#define TLE9563_DSOV_LS2DSOV_BRK_Pos      (9UL)                     /*!< LS2DSOV_BRK (Bit 9)                                   */
#define TLE9563_DSOV_LS2DSOV_BRK_Msk      (0x200UL)                 /*!< LS2DSOV_BRK (Bitfield-Mask: 0x01)                     */
#define TLE9563_DSOV_LS1DSOV_BRK_Pos      (8UL)                     /*!< LS1DSOV_BRK (Bit 8)                                   */
#define TLE9563_DSOV_LS1DSOV_BRK_Msk      (0x100UL)                 /*!< LS1DSOV_BRK (Bitfield-Mask: 0x01)                     */
#define TLE9563_DSOV_LS3DSOV_Pos          (5UL)                     /*!< LS3DSOV (Bit 5)                                       */
#define TLE9563_DSOV_LS3DSOV_Msk          (0x20UL)                  /*!< LS3DSOV (Bitfield-Mask: 0x01)                         */
#define TLE9563_DSOV_HS3DSOV_Pos          (4UL)                     /*!< HS3DSOV (Bit 4)                                       */
#define TLE9563_DSOV_HS3DSOV_Msk          (0x10UL)                  /*!< HS3DSOV (Bitfield-Mask: 0x01)                         */
#define TLE9563_DSOV_LS2DSOV_Pos          (3UL)                     /*!< LS2DSOV (Bit 3)                                       */
#define TLE9563_DSOV_LS2DSOV_Msk          (0x8UL)                   /*!< LS2DSOV (Bitfield-Mask: 0x01)                         */
#define TLE9563_DSOV_HS2DSOV_Pos          (2UL)                     /*!< HS2DSOV (Bit 2)                                       */
#define TLE9563_DSOV_HS2DSOV_Msk          (0x4UL)                   /*!< HS2DSOV (Bitfield-Mask: 0x01)                         */
#define TLE9563_DSOV_LS1DSOV_Pos          (1UL)                     /*!< LS1DSOV (Bit 1)                                       */
#define TLE9563_DSOV_LS1DSOV_Msk          (0x2UL)                   /*!< LS1DSOV (Bitfield-Mask: 0x01)                         */
#define TLE9563_DSOV_HS1DSOV_Pos          (0UL)                     /*!< HS1DSOV (Bit 0)                                       */
#define TLE9563_DSOV_HS1DSOV_Msk          (0x1UL)                   /*!< HS1DSOV (Bitfield-Mask: 0x01)                         */
/* =====================================================  EFF_TDON_OFF1  ===================================================== */
#define TLE9563_EFF_TDON_OFF1_TDOFF1EFF_Pos (8UL)                   /*!< TDOFF1EFF (Bit 8)                                     */
#define TLE9563_EFF_TDON_OFF1_TDOFF1EFF_Msk (0x3f00UL)              /*!< TDOFF1EFF (Bitfield-Mask: 0x3f)                       */
#define TLE9563_EFF_TDON_OFF1_TDON1EFF_Pos (0UL)                    /*!< TDON1EFF (Bit 0)                                      */
#define TLE9563_EFF_TDON_OFF1_TDON1EFF_Msk (0x3fUL)                 /*!< TDON1EFF (Bitfield-Mask: 0x3f)                        */
/* =====================================================  EFF_TDON_OFF2  ===================================================== */
#define TLE9563_EFF_TDON_OFF2_TDOFF2EFF_Pos (8UL)                   /*!< TDOFF2EFF (Bit 8)                                     */
#define TLE9563_EFF_TDON_OFF2_TDOFF2EFF_Msk (0x3f00UL)              /*!< TDOFF2EFF (Bitfield-Mask: 0x3f)                       */
#define TLE9563_EFF_TDON_OFF2_TDON2EFF_Pos (0UL)                    /*!< TDON2EFF (Bit 0)                                      */
#define TLE9563_EFF_TDON_OFF2_TDON2EFF_Msk (0x3fUL)                 /*!< TDON2EFF (Bitfield-Mask: 0x3f)                        */
/* =====================================================  EFF_TDON_OFF3  ===================================================== */
#define TLE9563_EFF_TDON_OFF3_TDOFF3EFF_Pos (8UL)                   /*!< TDOFF3EFF (Bit 8)                                     */
#define TLE9563_EFF_TDON_OFF3_TDOFF3EFF_Msk (0x3f00UL)              /*!< TDOFF3EFF (Bitfield-Mask: 0x3f)                       */
#define TLE9563_EFF_TDON_OFF3_TDON3EFF_Pos (0UL)                    /*!< TDON3EFF (Bit 0)                                      */
#define TLE9563_EFF_TDON_OFF3_TDON3EFF_Msk (0x3fUL)                 /*!< TDON3EFF (Bitfield-Mask: 0x3f)                        */
/* ======================================================  TRISE_FALL1  ====================================================== */
#define TLE9563_TRISE_FALL1_TFALL1_Pos    (8UL)                     /*!< TFALL1 (Bit 8)                                        */
#define TLE9563_TRISE_FALL1_TFALL1_Msk    (0x3f00UL)                /*!< TFALL1 (Bitfield-Mask: 0x3f)                          */
#define TLE9563_TRISE_FALL1_TRISE1_Pos    (0UL)                     /*!< TRISE1 (Bit 0)                                        */
#define TLE9563_TRISE_FALL1_TRISE1_Msk    (0x3fUL)                  /*!< TRISE1 (Bitfield-Mask: 0x3f)                          */
/* ======================================================  TRISE_FALL2  ====================================================== */
#define TLE9563_TRISE_FALL2_TFALL2_Pos    (8UL)                     /*!< TFALL2 (Bit 8)                                        */
#define TLE9563_TRISE_FALL2_TFALL2_Msk    (0x3f00UL)                /*!< TFALL2 (Bitfield-Mask: 0x3f)                          */
#define TLE9563_TRISE_FALL2_TRISE2_Pos    (0UL)                     /*!< TRISE2 (Bit 0)                                        */
#define TLE9563_TRISE_FALL2_TRISE2_Msk    (0x3fUL)                  /*!< TRISE2 (Bitfield-Mask: 0x3f)                          */
/* ======================================================  TRISE_FALL3  ====================================================== */
#define TLE9563_TRISE_FALL3_TFALL3_Pos    (8UL)                     /*!< TFALL3 (Bit 8)                                        */
#define TLE9563_TRISE_FALL3_TFALL3_Msk    (0x3f00UL)                /*!< TFALL3 (Bitfield-Mask: 0x3f)                          */
#define TLE9563_TRISE_FALL3_TRISE3_Pos    (0UL)                     /*!< TRISE3 (Bit 0)                                        */
#define TLE9563_TRISE_FALL3_TRISE3_Msk    (0x3fUL)                  /*!< TRISE3 (Bitfield-Mask: 0x3f)                          */
/* =======================================================  SWK_STAT  ======================================================== */
#define TLE9563_SWK_STAT_SYNC_Pos         (6UL)                     /*!< SYNC (Bit 6)                                          */
#define TLE9563_SWK_STAT_SYNC_Msk         (0x40UL)                  /*!< SYNC (Bitfield-Mask: 0x01)                            */
#define TLE9563_SWK_STAT_WUP_Pos          (5UL)                     /*!< WUP (Bit 5)                                           */
#define TLE9563_SWK_STAT_WUP_Msk          (0x20UL)                  /*!< WUP (Bitfield-Mask: 0x01)                             */
#define TLE9563_SWK_STAT_WUF_Pos          (4UL)                     /*!< WUF (Bit 4)                                           */
#define TLE9563_SWK_STAT_WUF_Msk          (0x10UL)                  /*!< WUF (Bitfield-Mask: 0x01)                             */
#define TLE9563_SWK_STAT_CANSIL_Pos       (3UL)                     /*!< CANSIL (Bit 3)                                        */
#define TLE9563_SWK_STAT_CANSIL_Msk       (0x8UL)                   /*!< CANSIL (Bitfield-Mask: 0x01)                          */
#define TLE9563_SWK_STAT_SWK_SET_Pos      (2UL)                     /*!< SWK_SET (Bit 2)                                       */
#define TLE9563_SWK_STAT_SWK_SET_Msk      (0x4UL)                   /*!< SWK_SET (Bitfield-Mask: 0x01)                         */
/* =====================================================  SWK_ECNT_STAT  ===================================================== */
#define TLE9563_SWK_ECNT_STAT_ECNT_Pos    (0UL)                     /*!< ECNT (Bit 0)                                          */
#define TLE9563_SWK_ECNT_STAT_ECNT_Msk    (0x3fUL)                  /*!< ECNT (Bitfield-Mask: 0x3f)                            */
/* =====================================================  SWK_CDR_STAT  ====================================================== */
#define TLE9563_SWK_CDR_STAT_N_AVG_Pos    (4UL)                     /*!< N_AVG (Bit 4)                                         */
#define TLE9563_SWK_CDR_STAT_N_AVG_Msk    (0xfff0UL)                /*!< N_AVG (Bitfield-Mask: 0xfff)                          */
/* =====================================================  FAM_PROD_STAT  ===================================================== */
#define TLE9563_FAM_PROD_STAT_FAM_Pos     (7UL)                     /*!< FAM (Bit 7)                                           */
#define TLE9563_FAM_PROD_STAT_FAM_Msk     (0x780UL)                 /*!< FAM (Bitfield-Mask: 0x0f)                             */
#define TLE9563_FAM_PROD_STAT_PROD_Pos    (0UL)                     /*!< PROD (Bit 0)                                          */
#define TLE9563_FAM_PROD_STAT_PROD_Msk    (0x7fUL)                  /*!< PROD (Bitfield-Mask: 0x7f)                            */
/* ===============================================  STATUS INFORMATION FIELD  ================================================ */
#define TLE9563_SIF_SPI_CRC_FAIL_Pos      (7UL)                     /*!< SPI_CRC_FAIL (Bit 7)                                  */
#define TLE9563_SIF_SPI_CRC_FAIL_Msk      (0x80UL)                  /*!< SPI_CRC_FAIL (Bitfield-Mask: 0x01)                    */
#define TLE9563_SIF_BD_STAT_Pos           (6UL)                     /*!< BD_STAT (Bit 6)                                       */
#define TLE9563_SIF_BD_STAT_Msk           (0x40UL)                  /*!< BD_STAT (Bitfield-Mask: 0x01)                         */
#define TLE9563_SIF_DEV_STAT_Pos          (5UL)                     /*!< DEV_STAT (Bit 5)                                      */
#define TLE9563_SIF_DEV_STAT_Msk          (0x20UL)                  /*!< DEV_STAT (Bitfield-Mask: 0x01)                        */
#define TLE9563_SIF_HS_STAT_Pos           (4UL)                     /*!< HS_STAT (Bit 4)                                       */
#define TLE9563_SIF_HS_STAT_Msk           (0x10UL)                  /*!< HS_STAT (Bitfield-Mask: 0x01)                         */
#define TLE9563_SIF_WAKE_UP_Pos           (3UL)                     /*!< WAKE_UP (Bit 3)                                       */
#define TLE9563_SIF_WAKE_UP_Msk           (0x8UL)                   /*!< WAKE_UP (Bitfield-Mask: 0x01)                         */
#define TLE9563_SIF_BUS_STAT_Pos          (2UL)                     /*!< BUS_STAT (Bit 2)                                      */
#define TLE9563_SIF_BUS_STAT_Msk          (0x4UL)                   /*!< BUS_STAT (Bitfield-Mask: 0x01)                        */
#define TLE9563_SIF_TEMP_STAT_Pos         (1UL)                     /*!< TEMP_STAT (Bit 1)                                     */
#define TLE9563_SIF_TEMP_STAT_Msk         (0x2UL)                   /*!< TEMP_STAT (Bitfield-Mask: 0x01)                       */
#define TLE9563_SIF_SUPPLY_STAT_Pos       (0UL)                     /*!< SUPPLY_STAT (Bit 0)                                   */
#define TLE9563_SIF_SUPPLY_STAT_Msk       (0x1UL)                   /*!< SUPPLY_STAT (Bitfield-Mask: 0x01)                     */

/** @} */ /* End of group PosMask_peripherals */


#ifdef __cplusplus
}
#endif

#endif /* TLE9563_H */


/** @} */ /* End of group TLE9563 */

/** @} */ /* End of group Infineon */

